
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第13节：GCD · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2020-02-02-weak实现.html" />
    
    
    <link rel="prev" href="2018-09-20-深入理解Objective-C：Category.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    第一章
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="2016-03-09-FBKVOController.html">
            
                <a href="2016-03-09-FBKVOController.html">
            
                    
                    第1节：FBKVOController
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="2016-03-15-learn-BlocksKit.html">
            
                <a href="2016-03-15-learn-BlocksKit.html">
            
                    
                    第2节：learn-BlocksKit
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="2016-03-21-线程队列.html">
            
                <a href="2016-03-21-线程队列.html">
            
                    
                    第3节：线程队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="2016-04-08-runtime.html">
            
                <a href="2016-04-08-runtime.html">
            
                    
                    第4节：runtime
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="2016-04-24-琐碎.html">
            
                <a href="2016-04-24-琐碎.html">
            
                    
                    第5节：琐碎
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="2016-07-08-hotfix调用.html">
            
                <a href="2016-07-08-hotfix调用.html">
            
                    
                    第6节：hotfix调用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="2016-08-18-ios中使用blend改变图片颜色.html">
            
                <a href="2016-08-18-ios中使用blend改变图片颜色.html">
            
                    
                    第7节：ios中使用blend改变图片颜色
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="2016-08-29-图片扩展.html">
            
                <a href="2016-08-29-图片扩展.html">
            
                    
                    第8节：图片扩展
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="2016-10-27-iOS10_textfield下沉问题.html">
            
                <a href="2016-10-27-iOS10_textfield下沉问题.html">
            
                    
                    第9节：iOS10_textfield下沉问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="2018-01-21-Grid.html">
            
                <a href="2018-01-21-Grid.html">
            
                    
                    第10节：Grid
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.11" data-path="2018-03-21-优化iPhone存储空间惹的祸.html">
            
                <a href="2018-03-21-优化iPhone存储空间惹的祸.html">
            
                    
                    第11节：优化iPhone存储空间惹的祸
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.12" data-path="2018-09-20-深入理解Objective-C：Category.html">
            
                <a href="2018-09-20-深入理解Objective-C：Category.html">
            
                    
                    第12节：深入理解Objective-C：Category
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.13" data-path="2019-09-17-GCD.html">
            
                <a href="2019-09-17-GCD.html">
            
                    
                    第13节：GCD
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.14" data-path="2020-02-02-weak实现.html">
            
                <a href="2020-02-02-weak实现.html">
            
                    
                    第14节：weak实现
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.15" data-path="2019-10-11-Objective-C-Runtime.html">
            
                <a href="2019-10-11-Objective-C-Runtime.html">
            
                    
                    第15节：再识runtime
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../Chapter2/">
            
                <a href="../Chapter2/">
            
                    
                    第二章
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../Chapter2/2017-04-03-徽杭古道.html">
            
                <a href="../Chapter2/2017-04-03-徽杭古道.html">
            
                    
                    第1节：徽杭古道
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../Chapter3/">
            
                <a href="../Chapter3/">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../Chapter4/">
            
                <a href="../Chapter4/">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第13节：GCD</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="gcd">GCD</h2>
<h3 id="1gcd&#x7B80;&#x4ECB;">1.GCD&#x7B80;&#x4ECB;</h3>
<h4 id="&#x4EC0;&#x4E48;&#x662F;gcd">&#x4EC0;&#x4E48;&#x662F;GCD</h4>
<p>Grand Central Dispatch&#xFF08;GCD&#xFF09;&#x662F; Apple &#x5F00;&#x53D1;&#x7684;&#x4E00;&#x4E2A;&#x591A;&#x6838;&#x7F16;&#x7A0B;&#x7684;&#x8F83;&#x65B0;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x3002;&#x5B83;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x4F18;&#x5316;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x652F;&#x6301;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x5BF9;&#x79F0;&#x591A;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5728;&#x7EBF;&#x7A0B;&#x6C60;&#x6A21;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x6267;&#x884C;&#x7684;&#x5E76;&#x53D1;&#x4EFB;&#x52A1;&#x3002;&#x5728; Mac OS X 10.6 &#x96EA;&#x8C79;&#x4E2D;&#x9996;&#x6B21;&#x63A8;&#x51FA;&#xFF0C;&#x4E5F;&#x53EF;&#x5728; iOS 4 &#x53CA;&#x4EE5;&#x4E0A;&#x7248;&#x672C;&#x4F7F;&#x7528;&#x3002;</p>
<p>GCD&#xFF0C;&#x662F;&#x4E00;&#x5957;&#x4F4E;&#x5C42;API&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x8FDB;&#x884C;&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x7F16;&#x5199;&#x3002;&#x4ECE;&#x57FA;&#x672C;&#x529F;&#x80FD;&#x4E0A;&#x8BB2;&#xFF0C;GCD&#x6709;&#x70B9;&#x50CF;NSOperationQueue&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5C06;&#x4EFB;&#x52A1;&#x5207;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x5355;&#x4E00;&#x4EFB;&#x52A1;&#x7136;&#x540E;&#x63D0;&#x4EA4;&#x81F3;&#x5DE5;&#x4F5C;&#x961F;&#x5217;&#x6765;&#x5E76;&#x53D1;&#x5730;&#x6216;&#x8005;&#x4E32;&#x884C;&#x5730;&#x6267;&#x884C;&#x3002;GCD&#x6BD4;&#x4E4B;NSOpertionQueue&#x66F4;&#x5E95;&#x5C42;&#x66F4;&#x9AD8;&#x6548;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4E0D;&#x662F;Cocoa&#x6846;&#x67B6;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x9664;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x5E73;&#x884C;&#x6267;&#x884C;&#x80FD;&#x529B;&#xFF0C;GCD&#x8FD8;&#x63D0;&#x4F9B;&#x9AD8;&#x5EA6;&#x96C6;&#x6210;&#x7684;&#x4E8B;&#x4EF6;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x3002;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x53E5;&#x67C4;&#x6765;&#x54CD;&#x5E94;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3001;mach ports&#xFF08;Mach port&#x7528;&#x4E8E; OS X&#x4E0A;&#x7684;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x8BAF;&#xFF09;&#x3001;&#x8FDB;&#x7A0B;&#x3001;&#x8BA1;&#x65F6;&#x5668;&#x3001;&#x4FE1;&#x53F7;&#x3001;&#x7528;&#x6237;&#x751F;&#x6210;&#x4E8B;&#x4EF6;&#x3002;&#x8FD9;&#x4E9B;&#x53E5;&#x67C4;&#x901A;&#x8FC7;GCD&#x6765;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x3002;GCD&#x7684;API&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x57FA;&#x4E8E;block&#xFF0C;&#x5F53;&#x7136;&#xFF0C;GCD&#x4E5F;&#x53EF;&#x4EE5;&#x8131;&#x79BB;block&#x6765;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x4F20;&#x7EDF;c&#x673A;&#x5236;&#x63D0;&#x4F9B;&#x51FD;&#x6570;&#x6307;&#x9488;&#x548C;&#x4E0A;&#x4E0B;&#x6587;&#x6307;&#x9488;&#x3002;&#x5B9E;&#x8DF5;&#x8BC1;&#x660E;&#xFF0C;&#x5F53;&#x914D;&#x5408;block&#x4F7F;&#x7528;&#x65F6;&#xFF0C;GCD&#x975E;&#x5E38;&#x7B80;&#x5355;&#x6613;&#x7528;&#x4E14;&#x80FD;&#x53D1;&#x6325;&#x5176;&#x6700;&#x5927;&#x80FD;&#x529B;</p>
<h4 id="&#x4E3A;&#x4F55;&#x4F7F;&#x7528;">&#x4E3A;&#x4F55;&#x4F7F;&#x7528;?</h4>
<p>GCD&#x63D0;&#x4F9B;&#x5F88;&#x591A;&#x8D85;&#x8D8A;&#x4F20;&#x7EDF;&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7A0B;&#x7684;&#x4F18;&#x52BF;&#xFF1A;&#x6613;&#x7528;:GCD&#x6BD4;&#x4E4B;thread&#x8DDF;&#x7B80;&#x5355;&#x6613;&#x7528;&#x3002;&#x7531;&#x4E8E;GCD&#x57FA;&#x4E8E;work unit&#x800C;&#x975E;&#x50CF;thread&#x90A3;&#x6837;&#x57FA;&#x4E8E;&#x8FD0;&#x7B97;&#xFF0C;&#x6240;&#x4EE5;GCD&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x8BF8;&#x5982;&#x7B49;&#x5F85;&#x4EFB;&#x52A1;&#x7ED3;&#x675F;&#x3001;&#x76D1;&#x89C6;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3001;&#x5468;&#x671F;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x4EE5;&#x53CA;&#x5DE5;&#x4F5C;&#x6302;&#x8D77;&#x7B49;&#x4EFB;&#x52A1;&#x3002;&#x57FA;&#x4E8E;block&#x7684;&#x8840;&#x7EDF;&#x5BFC;&#x81F4;&#x5B83;&#x80FD;&#x6781;&#x4E3A;&#x7B80;&#x5355;&#x5F97;&#x5728;&#x4E0D;&#x540C;&#x4EE3;&#x7801;&#x4F5C;&#x7528;&#x57DF;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x4E0A;&#x4E0B;&#x6587;&#x3002;</p>
<p>&#x6548;&#x7387;:GCD&#x88AB;&#x5B9E;&#x73B0;&#x5F97;&#x5982;&#x6B64;&#x8F7B;&#x91CF;&#x548C;&#x4F18;&#x96C5;&#xFF0C;&#x4F7F;&#x5F97;&#x5B83;&#x5728;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x6BD4;&#x4E4B;&#x4E13;&#x95E8;&#x521B;&#x5EFA;&#x6D88;&#x8017;&#x8D44;&#x6E90;&#x7684;&#x7EBF;&#x7A0B;&#x66F4;&#x5B9E;&#x7528;&#x4E14;&#x5FEB;&#x901F;&#x3002;&#x8FD9;&#x5173;&#x7CFB;&#x5230;&#x6613;&#x7528;&#x6027;&#xFF1A;&#x5BFC;&#x81F4;GCD&#x6613;&#x7528;&#x7684;&#x539F;&#x56E0;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x5728;&#x4E8E;&#x4F60;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x592A;&#x591A;&#x7684;&#x6548;&#x7387;&#x95EE;&#x9898;&#x800C;&#x4EC5;&#x4EC5;&#x4F7F;&#x7528;&#x5B83;&#x5C31;&#x884C;&#x4E86;&#x3002;</p>
<p>&#x6027;&#x80FD;:GCD&#x81EA;&#x52A8;&#x6839;&#x636E;&#x7CFB;&#x7EDF;&#x8D1F;&#x8F7D;&#x6765;&#x589E;&#x51CF;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#xFF0C;&#x8FD9;&#x5C31;&#x51CF;&#x5C11;&#x4E86;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x4EE5;&#x53CA;&#x589E;&#x52A0;&#x4E86;&#x8BA1;&#x7B97;&#x6548;&#x7387;&#x3002;</p>
<ul>
<li>GCD &#x53EF;&#x7528;&#x4E8E;&#x591A;&#x6838;&#x7684;&#x5E76;&#x884C;&#x8FD0;&#x7B97;&#xFF1B;</li>
<li>GCD &#x4F1A;&#x81EA;&#x52A8;&#x5229;&#x7528;&#x66F4;&#x591A;&#x7684; CPU &#x5185;&#x6838;&#xFF08;&#x6BD4;&#x5982;&#x53CC;&#x6838;&#x3001;&#x56DB;&#x6838;&#xFF09;&#xFF1B;</li>
<li>GCD &#x4F1A;&#x81EA;&#x52A8;&#x7BA1;&#x7406;&#x7EBF;&#x7A0B;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF08;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x3001;&#x8C03;&#x5EA6;&#x4EFB;&#x52A1;&#x3001;&#x9500;&#x6BC1;&#x7EBF;&#x7A0B;&#xFF09;&#xFF1B;</li>
<li>&#x7A0B;&#x5E8F;&#x5458;&#x53EA;&#x9700;&#x8981;&#x544A;&#x8BC9; GCD &#x60F3;&#x8981;&#x6267;&#x884C;&#x4EC0;&#x4E48;&#x4EFB;&#x52A1;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x7F16;&#x5199;&#x4EFB;&#x4F55;&#x7EBF;&#x7A0B;&#x7BA1;&#x7406;&#x4EE3;&#x7801;&#x3002;</li>
</ul>
<h3 id="2gcd&#x4EFB;&#x52A1;&#x548C;&#x961F;&#x5217;">2.GCD&#x4EFB;&#x52A1;&#x548C;&#x961F;&#x5217;</h3>
<p>GCD &#x4E24;&#x4E2A;&#x6838;&#x5FC3;&#x6982;&#x5FF5;&#xFF1A;&#x300E;<strong>&#x4EFB;&#x52A1;</strong>&#x300F; &#x548C; &#x300E;<strong>&#x961F;&#x5217;</strong>&#x300F;&#x3002;
&#x4EFB;&#x52A1;&#xFF1A;&#x5C31;&#x662F;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#x5C31;&#x662F;&#x4F60;&#x5728;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x3002;&#x5728; GCD &#x4E2D;&#x662F;&#x653E;&#x5728; block &#x4E2D;&#x7684;&#x3002;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;&#x300E;<strong>&#x540C;&#x6B65;&#x6267;&#x884C;</strong>&#x300F; &#x548C; &#x300E;<strong>&#x5F02;&#x6B65;&#x6267;&#x884C;</strong>&#x300F;&#x3002;&#x4E24;&#x8005;&#x7684;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x662F;&#xFF1A;<strong>&#x662F;&#x5426;&#x7B49;&#x5F85;&#x961F;&#x5217;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7ED3;&#x675F;&#xFF0C;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x5177;&#x5907;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;</strong>&#x3002;</p>
<ul>
<li><p><strong>&#x540C;&#x6B65;&#x6267;&#x884C;&#xFF08;sync&#xFF09;</strong>&#xFF1A;</p>
<ul>
<li>&#x540C;&#x6B65;&#x6DFB;&#x52A0;&#x4EFB;&#x52A1;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x5728;&#x6DFB;&#x52A0;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7ED3;&#x675F;&#x4E4B;&#x524D;&#xFF0C;&#x4F1A;&#x4E00;&#x76F4;&#x7B49;&#x5F85;&#xFF0C;&#x76F4;&#x5230;&#x961F;&#x5217;&#x91CC;&#x9762;&#x7684;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x518D;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;</li>
<li>&#x53EA;&#x80FD;&#x5728;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x4E0D;&#x5177;&#x5907;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#x3002;</li>
</ul>
</li>
<li><p><strong>&#x5F02;&#x6B65;&#x6267;&#x884C;&#xFF08;async&#xFF09;</strong>&#xFF1A;</p>
<ul>
<li>&#x5F02;&#x6B65;&#x6DFB;&#x52A0;&#x4EFB;&#x52A1;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x505A;&#x4EFB;&#x4F55;&#x7B49;&#x5F85;&#xFF0C;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;</li>
<li>&#x53EF;&#x4EE5;&#x5728;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x5177;&#x5907;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#x3002;</li>
</ul>
</li>
</ul>
<p>&#x4E3E;&#x4E2A;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#xFF1A;&#x4F60;&#x8981;&#x6253;&#x7535;&#x8BDD;&#x7ED9;&#x5C0F;&#x660E;&#x548C;&#x5C0F;&#x767D;&#x3002;
&#x300E;<strong>&#x540C;&#x6B65;&#x6267;&#x884C;</strong>&#x300F; &#x5C31;&#x662F;&#xFF1A;&#x4F60;&#x6253;&#x7535;&#x8BDD;&#x7ED9;&#x5C0F;&#x660E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x6253;&#x7ED9;&#x5C0F;&#x767D;&#x3002;&#x53EA;&#x6709;&#x7B49;&#x5230;&#x7ED9;&#x5C0F;&#x660E;&#x6253;&#x5B8C;&#x4E86;&#xFF0C;&#x624D;&#x80FD;&#x6253;&#x7ED9;&#x5C0F;&#x767D;&#xFF08;&#x7B49;&#x5F85;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7ED3;&#x675F;&#xFF09;&#x3002;&#x800C;&#x4E14;&#x53EA;&#x80FD;&#x7528;&#x5F53;&#x524D;&#x7684;&#x7535;&#x8BDD;&#xFF08;&#x4E0D;&#x5177;&#x5907;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#xFF09;&#x3002;
&#x300E;<strong>&#x5F02;&#x6B65;&#x6267;&#x884C;</strong>&#x300F; &#x5C31;&#x662F;&#xFF1A;&#x4F60;&#x6253;&#x7535;&#x8BDD;&#x7ED9;&#x5C0F;&#x660E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x7528;&#x7B49;&#x7740;&#x548C;&#x5C0F;&#x660E;&#x901A;&#x8BDD;&#x7ED3;&#x675F;&#xFF08;&#x4E0D;&#x7528;&#x7B49;&#x5F85;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7ED3;&#x675F;&#xFF09;&#xFF0C;&#x8FD8;&#x80FD;&#x540C;&#x65F6;&#x7ED9;&#x5C0F;&#x767D;&#x6253;&#x7535;&#x8BDD;&#x3002;&#x800C;&#x4E14;&#x9664;&#x4E86;&#x5F53;&#x524D;&#x7535;&#x8BDD;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7535;&#x8BDD;&#xFF08;&#x5177;&#x5907;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#xFF09;&#x3002;</p>
<pre><code>&#x6CE8;&#x610F;&#xFF1A;**&#x5F02;&#x6B65;&#x6267;&#x884C;&#xFF08;async&#xFF09;**&#x867D;&#x7136;&#x5177;&#x6709;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x3002;&#x8FD9;&#x8DDF;&#x4EFB;&#x52A1;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x961F;&#x5217;&#x7C7B;&#x578B;&#x6709;&#x5173;&#xFF08;&#x4E0B;&#x9762;&#x4F1A;&#x8BB2;&#xFF09;&#x3002;
</code></pre><p>&#x961F;&#x5217;&#xFF08;Dispatch Queue&#xFF09;&#xFF1A;&#x8FD9;&#x91CC;&#x7684;&#x961F;&#x5217;&#x6307;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x7684;&#x7B49;&#x5F85;&#x961F;&#x5217;&#xFF0C;&#x5373;&#x7528;&#x6765;&#x5B58;&#x653E;&#x4EFB;&#x52A1;&#x7684;&#x961F;&#x5217;&#x3002;&#x961F;&#x5217;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x7EBF;&#x6027;&#x8868;&#xFF0C;&#x91C7;&#x7528; FIFO&#xFF08;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF09;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x5373;&#x65B0;&#x4EFB;&#x52A1;&#x603B;&#x662F;&#x88AB;&#x63D2;&#x5165;&#x5230;&#x961F;&#x5217;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x800C;&#x8BFB;&#x53D6;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x5019;&#x603B;&#x662F;&#x4ECE;&#x961F;&#x5217;&#x7684;&#x5934;&#x90E8;&#x5F00;&#x59CB;&#x8BFB;&#x53D6;&#x3002;&#x6BCF;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x5219;&#x4ECE;&#x961F;&#x5217;&#x4E2D;&#x91CA;&#x653E;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x961F;&#x5217;&#x7684;&#x7ED3;&#x6784;&#x53EF;&#x53C2;&#x8003;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="https://user-gold-cdn.xitu.io/2019/8/23/16cbcfe6bbb81765" alt=""></p>
<p>&#x5728; GCD &#x4E2D;&#x6709;&#x4E24;&#x79CD;&#x961F;&#x5217;&#xFF1A;&#x300E;<strong>&#x4E32;&#x884C;&#x961F;&#x5217;</strong>&#x300F; &#x548C; &#x300E;<strong>&#x5E76;&#x53D1;&#x961F;&#x5217;</strong>&#x300F;&#x3002;&#x4E24;&#x8005;&#x90FD;&#x7B26;&#x5408; FIFO&#xFF08;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF09;&#x7684;&#x539F;&#x5219;&#x3002;&#x4E24;&#x8005;&#x7684;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x662F;&#xFF1A;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x4E0D;&#x540C;&#xFF0C;&#x4EE5;&#x53CA;&#x5F00;&#x542F;&#x7EBF;&#x7A0B;&#x6570;&#x4E0D;&#x540C;&#x3002;</p>
<ul>
<li><p><strong>&#x4E32;&#x884C;&#x961F;&#x5217;&#xFF08;Serial Dispatch Queue&#xFF09;</strong>&#xFF1A;</p>
<ul>
<li>&#x6BCF;&#x6B21;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x88AB;&#x6267;&#x884C;&#x3002;&#x8BA9;&#x4EFB;&#x52A1;&#x4E00;&#x4E2A;&#x63A5;&#x7740;&#x4E00;&#x4E2A;&#x5730;&#x6267;&#x884C;&#x3002;&#xFF08;&#x53EA;&#x5F00;&#x542F;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF09;</li>
</ul>
</li>
</ul>
<ul>
<li><p><strong>&#x5E76;&#x53D1;&#x961F;&#x5217;&#xFF08;Concurrent Dispatch Queue&#xFF09;</strong>&#xFF1A;</p>
<ul>
<li>&#x53EF;&#x4EE5;&#x8BA9;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x5E76;&#x53D1;&#xFF08;&#x540C;&#x65F6;&#xFF09;&#x6267;&#x884C;&#x3002;&#xFF08;&#x53EF;&#x4EE5;&#x5F00;&#x542F;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x540C;&#x65F6;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF09;</li>
</ul>
</li>
</ul>
<p><strong>&#x6CE8;&#xFF1A;&#x5E76;&#x53D1;&#x961F;&#x5217; &#x7684;&#x5E76;&#x53D1;&#x529F;&#x80FD;&#x53EA;&#x6709;&#x5728;&#x5F02;&#x6B65;&#xFF08;dispatch_async&#xFF09;&#x65B9;&#x6CD5;&#x4E0B;&#x624D;&#x6709;&#x6548;</strong></p>
<p>&#x4E24;&#x8005;&#x5177;&#x4F53;&#x533A;&#x522B;&#x5982;&#x4E0B;&#x4E24;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="https://user-gold-cdn.xitu.io/2019/8/23/16cbcfe6bc042916" alt=""></p>
<p><img src="https://user-gold-cdn.xitu.io/2019/8/23/16cbcfe6bc25291c" alt=""></p>
<h2 id="3gcd&#x7684;&#x4F7F;&#x7528;&#x6B65;&#x9AA4;">3.GCD&#x7684;&#x4F7F;&#x7528;&#x6B65;&#x9AA4;</h2>
<p>GCD&#x7684;&#x4F7F;&#x7528;&#x6B65;&#x9AA4;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x6B65;&#xFF1A;</p>
<ul>
<li>1.&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#xFF08;&#x4E32;&#x884C;&#x961F;&#x5217;&#x6216;&#x5E76;&#x53D1;&#x961F;&#x5217;&#xFF09;&#xFF1B;</li>
<li>2.&#x5C06;&#x4EFB;&#x52A1;&#x8FFD;&#x52A0;&#x5230;&#x4EFB;&#x52A1;&#x7684;&#x7B49;&#x5F85;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x7CFB;&#x7EDF;&#x5C31;&#x4F1A;&#x6839;&#x636E;&#x4EFB;&#x52A1;&#x7C7B;&#x578B;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF08;&#x540C;&#x6B65;&#x6267;&#x884C;&#x6216;&#x5F02;&#x6B65;&#x6267;&#x884C;&#xFF09;&#x3002;</li>
</ul>
<p>&#x4E0B;&#x8FB9;&#x6765;&#x770B;&#x770B;&#x961F;&#x5217;&#x7684;&#x521B;&#x5EFA;&#x65B9;&#x6CD5; / &#x83B7;&#x53D6;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x4EFB;&#x52A1;&#x7684;&#x521B;&#x5EFA;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="31-&#x961F;&#x5217;&#x7684;&#x521B;&#x5EFA;&#x65B9;&#x6CD5;&#x83B7;&#x53D6;&#x65B9;&#x6CD5;">3.1 &#x961F;&#x5217;&#x7684;&#x521B;&#x5EFA;&#x65B9;&#x6CD5;/&#x83B7;&#x53D6;&#x65B9;&#x6CD5;</h3>
<ul>
<li><p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528; dispatch_queue_create &#x65B9;&#x6CD5;&#x6765;&#x521B;&#x5EFA;&#x961F;&#x5217;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x4F20;&#x5165;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;</p>
<ul>
<li>&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x8868;&#x793A;&#x961F;&#x5217;&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x7528;&#x4E8E; DEBUG&#xFF0C;&#x53EF;&#x4E3A;&#x7A7A;&#x3002;&#x961F;&#x5217;&#x7684;&#x540D;&#x79F0;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F; ID &#x8FD9;&#x79CD;&#x9006;&#x5E8F;&#x5168;&#x7A0B;&#x57DF;&#x540D;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x7528;&#x6765;&#x8BC6;&#x522B;&#x662F;&#x4E32;&#x884C;&#x961F;&#x5217;&#x8FD8;&#x662F;&#x5E76;&#x53D1;&#x961F;&#x5217;&#x3002;DISPATCH_QUEUE_SERIAL &#x8868;&#x793A;&#x4E32;&#x884C;&#x961F;&#x5217;&#xFF0C;DISPATCH_QUEUE_CONCURRENT &#x8868;&#x793A;&#x5E76;&#x53D1;&#x961F;&#x5217;&#x3002;</li>
</ul>
</li>
</ul>
<p>```// &#x4E32;&#x884C;&#x961F;&#x5217;&#x7684;&#x521B;&#x5EFA;&#x65B9;&#x6CD5;
dispatch_queue_t queue = dispatch_queue_create(&quot;net.bujige.testQueue&quot;, DISPATCH_QUEUE_SERIAL);
// &#x5E76;&#x53D1;&#x961F;&#x5217;&#x7684;&#x521B;&#x5EFA;&#x65B9;&#x6CD5;
dispatch_queue_t queue = dispatch_queue_create(&quot;net.bujige.testQueue&quot;, DISPATCH_QUEUE_CONCURRENT);</p>
<pre><code>* &#x5BF9;&#x4E8E;&#x4E32;&#x884C;&#x961F;&#x5217;&#xFF0C;GCD &#x9ED8;&#x8BA4;&#x63D0;&#x4F9B;&#x4E86;&#xFF1A;&#x300E;&#x4E3B;&#x961F;&#x5217;&#xFF08;Main Dispatch Queue&#xFF09;&#x300F;&#x3002;
    * &#x6240;&#x6709;&#x653E;&#x5728;&#x4E3B;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x90FD;&#x4F1A;&#x653E;&#x5230;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x3002;
    * &#x53EF;&#x4F7F;&#x7528; dispatch_get_main_queue() &#x65B9;&#x6CD5;&#x83B7;&#x5F97;&#x4E3B;&#x961F;&#x5217;&#x3002;
</code></pre><p>&#x6CE8;&#x610F;&#xFF1A;&#x4E3B;&#x961F;&#x5217;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x7279;&#x6B8A;&#x3002; &#x4E3B;&#x961F;&#x5217;&#x7684;&#x5B9E;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x4E32;&#x884C;&#x961F;&#x5217;&#xFF0C;&#x53EA;&#x662F;&#x56E0;&#x4E3A;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;&#x524D;&#x4EE3;&#x7801;&#x662F;&#x653E;&#x5728;&#x4E3B;&#x961F;&#x5217;&#x4E2D;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x4E3B;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53C8;&#x90FD;&#x4F1A;&#x653E;&#x5230;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x53BB;&#x6267;&#x884C;&#xFF0C;&#x6240;&#x4EE5;&#x624D;&#x9020;&#x6210;&#x4E86;&#x4E3B;&#x961F;&#x5217;&#x7279;&#x6B8A;&#x7684;&#x73B0;&#x8C61;&#x3002;</p>
<pre><code>

</code></pre><p>// &#x4E3B;&#x961F;&#x5217;&#x7684;&#x83B7;&#x53D6;&#x65B9;&#x6CD5;
dispatch_queue_t queue = dispatch_get_main_queue();</p>
<pre><code>
* &#x5BF9;&#x4E8E;&#x5E76;&#x53D1;&#x961F;&#x5217;&#xFF0C;GCD &#x9ED8;&#x8BA4;&#x63D0;&#x4F9B;&#x4E86; &#x300E;&#x5168;&#x5C40;&#x5E76;&#x53D1;&#x961F;&#x5217;&#xFF08;Global Dispatch Queue&#xFF09;&#x300F;&#x3002;
    * &#x53EF;&#x4EE5;&#x4F7F;&#x7528; dispatch_get_global_queue &#x65B9;&#x6CD5;&#x6765;&#x83B7;&#x53D6;&#x5168;&#x5C40;&#x5E76;&#x53D1;&#x961F;&#x5217;&#x3002;&#x9700;&#x8981;&#x4F20;&#x5165;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x8868;&#x793A;&#x961F;&#x5217;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x4E00;&#x822C;&#x7528; DISPATCH_QUEUE_PRIORITY_DEFAULT&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x6682;&#x65F6;&#x6CA1;&#x7528;&#xFF0C;&#x7528; 0 &#x5373;&#x53EF;&#x3002;
</code></pre><p>// &#x5168;&#x5C40;&#x5E76;&#x53D1;&#x961F;&#x5217;&#x7684;&#x83B7;&#x53D6;&#x65B9;&#x6CD5;
dispatch_queue_t queue = dispatch_get_global_queue(DISPATCH_QUEUE_PRIORITY_DEFAULT, 0);</p>
<pre><code>
### 3.2 &#x4EFB;&#x52A1;&#x7684;&#x521B;&#x5EFA;&#x65B9;&#x6CD5;

GCD &#x63D0;&#x4F9B;&#x4E86;&#x540C;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x7684;&#x521B;&#x5EFA;&#x65B9;&#x6CD5; dispatch_sync &#x548C;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x65B9;&#x6CD5; dispatch_async&#x3002;
</code></pre><p>// &#x540C;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x65B9;&#x6CD5;
dispatch_sync(queue, ^{
    // &#x8FD9;&#x91CC;&#x653E;&#x540C;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x4EE3;&#x7801;
});
// &#x5F02;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x65B9;&#x6CD5;
dispatch_async(queue, ^{
    // &#x8FD9;&#x91CC;&#x653E;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x4EE3;&#x7801;
});</p>
<pre><code>
### 3.5 &#x5173;&#x4E8E;&#x4E0D;&#x540C;&#x961F;&#x5217;&#x548C;&#x4E0D;&#x540C;&#x4EFB;&#x52A1;&#x7684;&#x5F62;&#x8C61;&#x7406;&#x89E3;
</code></pre><p>&#x5047;&#x8BBE;&#x73B0;&#x5728;&#x6709; 5 &#x4E2A;&#x4EBA;&#x8981;&#x7A7F;&#x8FC7;&#x4E00;&#x9053;&#x95E8;&#x7981;&#xFF0C;&#x8FD9;&#x9053;&#x95E8;&#x7981;&#x603B;&#x5171;&#x6709; 10 &#x4E2A;&#x5165;&#x53E3;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x6253;&#x5F00;&#x51E0;&#x4E2A;&#x5165;&#x53E3;&#xFF0C;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x8BA9;&#x4E00;&#x4E2A;&#x4EBA;&#x5355;&#x72EC;&#x901A;&#x8FC7;&#x8FD8;&#x662F;&#x591A;&#x4E2A;&#x4EBA;&#x4E00;&#x8D77;&#x901A;&#x8FC7;&#x3002;&#x4E0D;&#x8FC7;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x53EA;&#x5F00;&#x542F;&#x4E00;&#x4E2A;&#x5165;&#x53E3;&#xFF0C;&#x4E14;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x91CC;&#xFF0C;&#x4EBA;&#x597D;&#x6BD4;&#x662F; &#x4EFB;&#x52A1;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x597D;&#x6BD4;&#x662F; &#x7CFB;&#x7EDF;&#xFF0C;&#x5165;&#x53E3;&#x5219;&#x4EE3;&#x8868; &#x7EBF;&#x7A0B;&#x3002;</p>
<p>5 &#x4E2A;&#x4EBA;&#x8868;&#x793A;&#x6709; 5 &#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;10 &#x4E2A;&#x5165;&#x53E3;&#x4EE3;&#x8868; 10 &#x6761;&#x7EBF;&#x7A0B;&#x3002;
&#x4E32;&#x884C;&#x961F;&#x5217; &#x597D;&#x6BD4;&#x662F; 5 &#x4E2A;&#x4EBA;&#x6392;&#x6210;&#x4E00;&#x652F;&#x957F;&#x961F;&#x3002;
&#x5E76;&#x53D1;&#x961F;&#x5217; &#x597D;&#x6BD4;&#x662F; 5 &#x4E2A;&#x4EBA;&#x6392;&#x6210;&#x591A;&#x652F;&#x961F;&#x4F0D;&#xFF0C;&#x6BD4;&#x5982; 2 &#x961F;&#xFF0C;&#x6216;&#x8005; 3 &#x961F;&#x3002;
&#x540C;&#x6B65;&#x4EFB;&#x52A1; &#x597D;&#x6BD4;&#x662F;&#x7BA1;&#x7406;&#x5458;&#x53EA;&#x5F00;&#x542F;&#x4E86;&#x4E00;&#x4E2A;&#x5165;&#x53E3;&#xFF08;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF09;&#x3002;
&#x5F02;&#x6B65;&#x4EFB;&#x52A1; &#x597D;&#x6BD4;&#x662F;&#x7BA1;&#x7406;&#x5458;&#x540C;&#x65F6;&#x5F00;&#x542F;&#x4E86;&#x591A;&#x4E2A;&#x5165;&#x53E3;&#xFF08;&#x5F53;&#x524D;&#x7EBF;&#x7A0B; + &#x65B0;&#x5F00;&#x7684;&#x7EBF;&#x7A0B;&#xFF09;&#x3002;</p>
<p>&#x300E;&#x5F02;&#x6B65;&#x6267;&#x884C; + &#x5E76;&#x53D1;&#x961F;&#x5217;&#x300F; &#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#xFF1A;&#x73B0;&#x5728;&#x7BA1;&#x7406;&#x5458;&#x5F00;&#x542F;&#x4E86;&#x591A;&#x4E2A;&#x5165;&#x53E3;&#xFF08;&#x6BD4;&#x5982; 3 &#x4E2A;&#x5165;&#x53E3;&#xFF09;&#xFF0C;5 &#x4E2A;&#x4EBA;&#x6392;&#x6210;&#x4E86;&#x591A;&#x652F;&#x961F;&#x4F0D;&#xFF08;&#x6BD4;&#x5982; 3 &#x652F;&#x961F;&#x4F0D;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x8FD9; 5 &#x4E2A;&#x4EBA;&#x5C31;&#x53EF;&#x4EE5; 3 &#x4E2A;&#x4EBA;&#x540C;&#x65F6;&#x4E00;&#x8D77;&#x7A7F;&#x8FC7;&#x95E8;&#x7981;&#x4E86;&#x3002;</p>
<p>&#x300E;&#x540C;&#x6B65;&#x6267;&#x884C; + &#x5E76;&#x53D1;&#x961F;&#x5217;&#x300F; &#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#xFF1A;&#x73B0;&#x5728;&#x7BA1;&#x7406;&#x5458;&#x53EA;&#x5F00;&#x542F;&#x4E86; 1 &#x4E2A;&#x5165;&#x53E3;&#xFF0C;5  &#x4E2A;&#x4EBA;&#x6392;&#x6210;&#x4E86;&#x591A;&#x652F;&#x961F;&#x4F0D;&#x3002;&#x867D;&#x7136;&#x8FD9; 5 &#x4E2A;&#x4EBA;&#x6392;&#x6210;&#x4E86;&#x591A;&#x652F;&#x961F;&#x4F0D;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x5F00;&#x4E86; 1 &#x4E2A;&#x5165;&#x53E3;&#x554A;&#xFF0C;&#x8FD9; 5 &#x4E2A;&#x4EBA;&#x867D;&#x7136;&#x90FD;&#x60F3;&#x5FEB;&#x70B9;&#x8FC7;&#x53BB;&#xFF0C;&#x4F46;&#x662F; 1 &#x4E2A;&#x5165;&#x53E3;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x8FC7; 1 &#x4E2A;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x5C31;&#x53EA;&#x597D;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x8D70;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x8868;&#x73B0;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#xFF1A;&#x987A;&#x6B21;&#x901A;&#x8FC7;&#x5165;&#x53E3;&#x3002;</p>
<p>&#x6362;&#x6210; GCD &#x91CC;&#x7684;&#x8BED;&#x8A00;&#x5C31;&#x662F;&#x8BF4;&#xFF1A;</p>
<p>&#x300E;&#x5F02;&#x6B65;&#x6267;&#x884C; + &#x5E76;&#x53D1;&#x961F;&#x5217;&#x300F;&#x5C31;&#x662F;&#xFF1A;&#x7CFB;&#x7EDF;&#x5F00;&#x542F;&#x4E86;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF08;&#x4E3B;&#x7EBF;&#x7A0B;+&#x5176;&#x4ED6;&#x5B50;&#x7EBF;&#x7A0B;&#xFF09;&#xFF0C;&#x4EFB;&#x52A1;&#x53EF;&#x4EE5;&#x591A;&#x4E2A;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x3002;
&#x300E;&#x540C;&#x6B65;&#x6267;&#x884C; + &#x5E76;&#x53D1;&#x961F;&#x5217;&#x300F;&#x5C31;&#x662F;&#xFF1A;&#x7CFB;&#x7EDF;&#x53EA;&#x9ED8;&#x8BA4;&#x5F00;&#x542F;&#x4E86;&#x4E00;&#x4E2A;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF0C;&#x6CA1;&#x6709;&#x5F00;&#x542F;&#x5B50;&#x7EBF;&#x7A0B;&#xFF0C;&#x867D;&#x7136;&#x4EFB;&#x52A1;&#x5904;&#x4E8E;&#x5E76;&#x53D1;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x4F46;&#x4E5F;&#x53EA;&#x80FD;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x4E86;&#x3002;</p>
<pre><code>
## 4. GCD &#x7684;&#x57FA;&#x672C;&#x4F7F;&#x7528;

### 4.1 &#x540C;&#x6B65;&#x6267;&#x884C; + &#x5E76;&#x53D1;&#x961F;&#x5217;

* &#x5728;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x4E0D;&#x4F1A;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;
</code></pre><p>/**</p>
<ul>
<li>&#x540C;&#x6B65;&#x6267;&#x884C; + &#x5E76;&#x53D1;&#x961F;&#x5217;</li>
<li><p>&#x7279;&#x70B9;&#xFF1A;&#x5728;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x4E0D;&#x4F1A;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;
*/</p>
<ul>
<li><p>(void)syncConcurrent {
NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
NSLog(@&quot;syncConcurrent---begin&quot;);</p>
<p>dispatch_queue_t queue = dispatch_queue_create(&quot;net.bujige.testQueue&quot;, DISPATCH_QUEUE_CONCURRENT);</p>
<p>dispatch_sync(queue, ^{
   // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
   [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
   NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
});</p>
<p>dispatch_sync(queue, ^{
   // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 2
   [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
   NSLog(@&quot;2---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
});</p>
<p>dispatch_sync(queue, ^{
   // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 3
   [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
   NSLog(@&quot;3---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
});</p>
<p>NSLog(@&quot;syncConcurrent---end&quot;);
}
```
&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
</li>
</ul>
</li>
</ul>
<pre><code>2019-08-08 14:32:53.542816+0800 YSC-GCD-demo[16332:4171500] currentThread---&lt;NSThread: 0x600002326940&gt;{number = 1, name = main}
2019-08-08 14:32:53.542964+0800 YSC-GCD-demo[16332:4171500] syncConcurrent---begin
2019-08-08 14:32:55.544329+0800 YSC-GCD-demo[16332:4171500] 1---&lt;NSThread: 0x600002326940&gt;{number = 1, name = main}
2019-08-08 14:32:57.545779+0800 YSC-GCD-demo[16332:4171500] 2---&lt;NSThread: 0x600002326940&gt;{number = 1, name = main}
2019-08-08 14:32:59.547154+0800 YSC-GCD-demo[16332:4171500] 3---&lt;NSThread: 0x600002326940&gt;{number = 1, name = main}
2019-08-08 14:32:59.547365+0800 YSC-GCD-demo[16332:4171500] syncConcurrent---end
</code></pre><p>&#x4ECE; &#x540C;&#x6B65;&#x6267;&#x884C; + &#x5E76;&#x53D1;&#x961F;&#x5217; &#x4E2D;&#x53EF;&#x770B;&#x5230;&#xFF1A;</p>
<ul>
<li>&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x662F;&#x5728;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF08;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF09;&#x4E2D;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x5F00;&#x542F;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#xFF08;&#x540C;&#x6B65;&#x6267;&#x884C;&#x4E0D;&#x5177;&#x5907;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#xFF09;&#x3002;</li>
<li>&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x5728;&#x6253;&#x5370;&#x7684; syncConcurrent---begin &#x548C; syncConcurrent---end &#x4E4B;&#x95F4;&#x6267;&#x884C;&#x7684;&#xFF08;&#x540C;&#x6B65;&#x4EFB;&#x52A1; &#x9700;&#x8981;&#x7B49;&#x5F85;&#x961F;&#x5217;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7ED3;&#x675F;&#xFF09;&#x3002;</li>
<li>&#x4EFB;&#x52A1;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x3002;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x539F;&#x56E0;&#xFF1A;&#x867D;&#x7136; &#x5E76;&#x53D1;&#x961F;&#x5217; &#x53EF;&#x4EE5;&#x5F00;&#x542F;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x540C;&#x65F6;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x672C;&#x8EAB;&#x4E0D;&#x80FD;&#x521B;&#x5EFA;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x8FD9;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF08;&#x540C;&#x6B65;&#x4EFB;&#x52A1; &#x4E0D;&#x5177;&#x5907;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x5C31;&#x4E0D;&#x5B58;&#x5728;&#x5E76;&#x53D1;&#x3002;&#x800C;&#x4E14;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x53EA;&#x6709;&#x7B49;&#x5F85;&#x5F53;&#x524D;&#x961F;&#x5217;&#x4E2D;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x7EE7;&#x7EED;&#x63A5;&#x7740;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x540C;&#x6B65;&#x4EFB;&#x52A1; &#x9700;&#x8981;&#x7B49;&#x5F85;&#x961F;&#x5217;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7ED3;&#x675F;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x4EFB;&#x52A1;&#x53EA;&#x80FD;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x88AB;&#x6267;&#x884C;&#x3002;</li>
</ul>
<h3 id="42-&#x5F02;&#x6B65;&#x6267;&#x884C;--&#x5E76;&#x53D1;&#x961F;&#x5217;">4.2 &#x5F02;&#x6B65;&#x6267;&#x884C; + &#x5E76;&#x53D1;&#x961F;&#x5217;</h3>
<ul>
<li>&#x53EF;&#x4EE5;&#x5F00;&#x542F;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4EFB;&#x52A1;&#x4EA4;&#x66FF;&#xFF08;&#x540C;&#x65F6;&#xFF09;&#x6267;&#x884C;&#x3002;</li>
</ul>
<pre><code>/**
 * &#x5F02;&#x6B65;&#x6267;&#x884C; + &#x5E76;&#x53D1;&#x961F;&#x5217;
 * &#x7279;&#x70B9;&#xFF1A;&#x53EF;&#x4EE5;&#x5F00;&#x542F;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4EFB;&#x52A1;&#x4EA4;&#x66FF;&#xFF08;&#x540C;&#x65F6;&#xFF09;&#x6267;&#x884C;&#x3002;
 */
- (void)asyncConcurrent {
    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;asyncConcurrent---begin&quot;);

    dispatch_queue_t queue = dispatch_queue_create(&quot;net.bujige.testQueue&quot;, DISPATCH_QUEUE_CONCURRENT);

    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 2
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;2---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 3
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;3---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    NSLog(@&quot;asyncConcurrent---end&quot;);
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre><code>2019-08-08 14:36:37.747966+0800 YSC-GCD-demo[17232:4187114] currentThread---&lt;NSThread: 0x60000206d380&gt;{number = 1, name = main}
2019-08-08 14:36:37.748150+0800 YSC-GCD-demo[17232:4187114] asyncConcurrent---begin
2019-08-08 14:36:37.748279+0800 YSC-GCD-demo[17232:4187114] asyncConcurrent---end
2019-08-08 14:36:39.752523+0800 YSC-GCD-demo[17232:4187204] 2---&lt;NSThread: 0x600002010980&gt;{number = 3, name = (null)}
2019-08-08 14:36:39.752527+0800 YSC-GCD-demo[17232:4187202] 3---&lt;NSThread: 0x600002018480&gt;{number = 5, name = (null)}
2019-08-08 14:36:39.752527+0800 YSC-GCD-demo[17232:4187203] 1---&lt;NSThread: 0x600002023400&gt;{number = 4, name = (null)}
</code></pre><p>&#x5728; &#x5F02;&#x6B65;&#x6267;&#x884C; + &#x5E76;&#x53D1;&#x961F;&#x5217; &#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF1A;</p>
<ul>
<li>&#x9664;&#x4E86;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF08;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF09;&#xFF0C;&#x7CFB;&#x7EDF;&#x53C8;&#x5F00;&#x542F;&#x4E86; 3 &#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x4EFB;&#x52A1;&#x662F;&#x4EA4;&#x66FF;/&#x540C;&#x65F6;&#x6267;&#x884C;&#x7684;&#x3002;&#xFF08;&#x5F02;&#x6B65;&#x6267;&#x884C; &#x5177;&#x5907;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#x3002;&#x4E14; &#x5E76;&#x53D1;&#x961F;&#x5217; &#x53EF;&#x5F00;&#x542F;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x540C;&#x65F6;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#xFF09;&#x3002;</li>
<li>&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x662F;&#x5728;&#x6253;&#x5370;&#x7684; syncConcurrent---begin &#x548C; syncConcurrent---end &#x4E4B;&#x540E;&#x624D;&#x6267;&#x884C;&#x7684;&#x3002;&#x8BF4;&#x660E;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x6CA1;&#x6709;&#x7B49;&#x5F85;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x5F00;&#x542F;&#x4E86;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x5728;&#x65B0;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF08;&#x5F02;&#x6B65;&#x6267;&#x884C; &#x4E0D;&#x505A;&#x7B49;&#x5F85;&#xFF0C;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF09;&#x3002;</li>
</ul>
<p><strong>&#x63A5;&#x4E0B;&#x6765;&#x518D;&#x6765;&#x8BB2;&#x8BB2;&#x4E32;&#x884C;&#x961F;&#x5217;&#x7684;&#x4E24;&#x79CD;&#x6267;&#x884C;&#x65B9;&#x5F0F;&#x3002;</strong></p>
<h3 id="43-&#x540C;&#x6B65;&#x6267;&#x884C;--&#x4E32;&#x884C;&#x961F;&#x5217;">4.3 &#x540C;&#x6B65;&#x6267;&#x884C; + &#x4E32;&#x884C;&#x961F;&#x5217;</h3>
<ul>
<li>&#x4E0D;&#x4F1A;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x5728;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x4EFB;&#x52A1;&#x662F;&#x4E32;&#x884C;&#x7684;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;</li>
</ul>
<pre><code>/**
 * &#x540C;&#x6B65;&#x6267;&#x884C; + &#x4E32;&#x884C;&#x961F;&#x5217;
 * &#x7279;&#x70B9;&#xFF1A;&#x4E0D;&#x4F1A;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x5728;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x4EFB;&#x52A1;&#x662F;&#x4E32;&#x884C;&#x7684;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;
 */
- (void)syncSerial {
    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;syncSerial---begin&quot;);

    dispatch_queue_t queue = dispatch_queue_create(&quot;net.bujige.testQueue&quot;, DISPATCH_QUEUE_SERIAL);

    dispatch_sync(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });
    dispatch_sync(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 2
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;2---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });
    dispatch_sync(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 3
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;3---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    NSLog(@&quot;syncSerial---end&quot;);
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;&#xFF1A;</p>
<pre><code>2019-08-08 14:39:31.366815+0800 YSC-GCD-demo[17285:4197645] currentThread---&lt;NSThread: 0x600001b5e940&gt;{number = 1, name = main}
2019-08-08 14:39:31.366952+0800 YSC-GCD-demo[17285:4197645] syncSerial---begin
2019-08-08 14:39:33.368256+0800 YSC-GCD-demo[17285:4197645] 1---&lt;NSThread: 0x600001b5e940&gt;{number = 1, name = main}
2019-08-08 14:39:35.369661+0800 YSC-GCD-demo[17285:4197645] 2---&lt;NSThread: 0x600001b5e940&gt;{number = 1, name = main}
2019-08-08 14:39:37.370991+0800 YSC-GCD-demo[17285:4197645] 3---&lt;NSThread: 0x600001b5e940&gt;{number = 1, name = main}
2019-08-08 14:39:37.371192+0800 YSC-GCD-demo[17285:4197645] syncSerial---end
</code></pre><p>&#x5728; &#x540C;&#x6B65;&#x6267;&#x884C; + &#x4E32;&#x884C;&#x961F;&#x5217; &#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF1A;</p>
<ul>
<li>&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x662F;&#x5728;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF08;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF09;&#x4E2D;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5F00;&#x542F;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#xFF08;&#x540C;&#x6B65;&#x6267;&#x884C; &#x4E0D;&#x5177;&#x5907;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#xFF09;&#x3002;</li>
<li>&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x5728;&#x6253;&#x5370;&#x7684; syncConcurrent---begin &#x548C; syncConcurrent---end &#x4E4B;&#x95F4;&#x6267;&#x884C;&#xFF08;&#x540C;&#x6B65;&#x4EFB;&#x52A1; &#x9700;&#x8981;&#x7B49;&#x5F85;&#x961F;&#x5217;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7ED3;&#x675F;&#xFF09;&#x3002;</li>
<li>&#x4EFB;&#x52A1;&#x662F;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#xFF08;&#x4E32;&#x884C;&#x961F;&#x5217; &#x6BCF;&#x6B21;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x88AB;&#x6267;&#x884C;&#xFF0C;&#x4EFB;&#x52A1;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF09;&#x3002;</li>
</ul>
<h3 id="44-&#x5F02;&#x6B65;&#x6267;&#x884C;--&#x4E32;&#x884C;&#x961F;&#x5217;">4.4 &#x5F02;&#x6B65;&#x6267;&#x884C; + &#x4E32;&#x884C;&#x961F;&#x5217;</h3>
<ul>
<li>&#x4F1A;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x4EFB;&#x52A1;&#x662F;&#x4E32;&#x884C;&#x7684;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;</li>
</ul>
<pre><code>/**
 * &#x5F02;&#x6B65;&#x6267;&#x884C; + &#x4E32;&#x884C;&#x961F;&#x5217;
 * &#x7279;&#x70B9;&#xFF1A;&#x4F1A;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x4EFB;&#x52A1;&#x662F;&#x4E32;&#x884C;&#x7684;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;
 */
- (void)asyncSerial {
    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;asyncSerial---begin&quot;);

    dispatch_queue_t queue = dispatch_queue_create(&quot;net.bujige.testQueue&quot;, DISPATCH_QUEUE_SERIAL);

    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });
    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 2
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;2---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });
    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 3
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;3---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    NSLog(@&quot;asyncSerial---end&quot;);
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;&#xFF1A;</p>
<pre><code>2019-08-08 14:40:53.944502+0800 YSC-GCD-demo[17313:4203018] currentThread---&lt;NSThread: 0x6000015da940&gt;{number = 1, name = main}
2019-08-08 14:40:53.944615+0800 YSC-GCD-demo[17313:4203018] asyncSerial---begin
2019-08-08 14:40:53.944710+0800 YSC-GCD-demo[17313:4203018] asyncSerial---end
2019-08-08 14:40:55.947709+0800 YSC-GCD-demo[17313:4203079] 1---&lt;NSThread: 0x6000015a0840&gt;{number = 3, name = (null)}
2019-08-08 14:40:57.952453+0800 YSC-GCD-demo[17313:4203079] 2---&lt;NSThread: 0x6000015a0840&gt;{number = 3, name = (null)}
2019-08-08 14:40:59.952943+0800 YSC-GCD-demo[17313:4203079] 3---&lt;NSThread: 0x6000015a0840&gt;{number = 3, name = (null)}
</code></pre><p>&#x5728; &#x5F02;&#x6B65;&#x6267;&#x884C; + &#x4E32;&#x884C;&#x961F;&#x5217; &#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF1A;</p>
<p>&#x5F00;&#x542F;&#x4E86;&#x4E00;&#x6761;&#x65B0;&#x7EBF;&#x7A0B;&#xFF08;&#x5F02;&#x6B65;&#x6267;&#x884C; &#x5177;&#x5907;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4E32;&#x884C;&#x961F;&#x5217; &#x53EA;&#x5F00;&#x542F;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF09;&#x3002;
&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x662F;&#x5728;&#x6253;&#x5370;&#x7684; syncConcurrent---begin &#x548C; syncConcurrent---end &#x4E4B;&#x540E;&#x624D;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x7684;&#xFF08;&#x5F02;&#x6B65;&#x6267;&#x884C; &#x4E0D;&#x4F1A;&#x505A;&#x4EFB;&#x4F55;&#x7B49;&#x5F85;&#xFF0C;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF09;&#x3002;
&#x4EFB;&#x52A1;&#x662F;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#xFF08;&#x4E32;&#x884C;&#x961F;&#x5217; &#x6BCF;&#x6B21;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x88AB;&#x6267;&#x884C;&#xFF0C;&#x4EFB;&#x52A1;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF09;&#x3002;</p>
<p>&#x4E0B;&#x8FB9;&#x8BB2;&#x8BB2;&#x521A;&#x624D;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x8FC7;&#x7684;&#xFF1A;<strong>&#x4E3B;&#x961F;&#x5217;</strong>&#x3002;</p>
<p>&#x4E3B;&#x961F;&#x5217;&#xFF1A;GCD &#x9ED8;&#x8BA4;&#x63D0;&#x4F9B;&#x7684; <strong>&#x4E32;&#x884C;&#x961F;&#x5217;</strong>&#x3002;</p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5E73;&#x5E38;&#x6240;&#x5199;&#x4EE3;&#x7801;&#x662F;&#x76F4;&#x63A5;&#x653E;&#x5728;&#x4E3B;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x3002;
&#x6240;&#x6709;&#x653E;&#x5728;&#x4E3B;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x90FD;&#x4F1A;&#x653E;&#x5230;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x3002;
&#x53EF;&#x4F7F;&#x7528; dispatch_get_main_queue() &#x83B7;&#x5F97;&#x4E3B;&#x961F;&#x5217;&#x3002;</p>
<p><strong>&#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x770B;&#x4E3B;&#x961F;&#x5217;&#x7684;&#x4E24;&#x79CD;&#x7EC4;&#x5408;&#x65B9;&#x5F0F;</strong>&#x3002;</p>
<h3 id="45-&#x540C;&#x6B65;&#x6267;&#x884C;--&#x4E3B;&#x961F;&#x5217;">4.5 &#x540C;&#x6B65;&#x6267;&#x884C; + &#x4E3B;&#x961F;&#x5217;</h3>
<p>&#x540C;&#x6B65;&#x6267;&#x884C; + &#x4E3B;&#x961F;&#x5217; &#x5728;&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;&#x7ED3;&#x679C;&#x4E5F;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;&#x4F1A;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;&#x5219;&#x4E0D;&#x4F1A;&#x3002;</p>
<h4 id="451-&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;-&#x300E;&#x540C;&#x6B65;&#x6267;&#x884C;--&#x4E3B;&#x961F;&#x5217;&#x300F;">4.5.1 &#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x8C03;&#x7528; &#x300E;&#x540C;&#x6B65;&#x6267;&#x884C; + &#x4E3B;&#x961F;&#x5217;&#x300F;</h4>
<ul>
<li>&#x4E92;&#x76F8;&#x7B49;&#x5F85;&#x5361;&#x4F4F;&#x4E0D;&#x53EF;&#x884C;</li>
</ul>
<pre><code>/**
 * &#x540C;&#x6B65;&#x6267;&#x884C; + &#x4E3B;&#x961F;&#x5217;
 * &#x7279;&#x70B9;(&#x4E3B;&#x7EBF;&#x7A0B;&#x8C03;&#x7528;)&#xFF1A;&#x4E92;&#x7B49;&#x5361;&#x4E3B;&#x4E0D;&#x6267;&#x884C;&#x3002;
 * &#x7279;&#x70B9;(&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x8C03;&#x7528;)&#xFF1A;&#x4E0D;&#x4F1A;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;
 */
- (void)syncMain {

    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;syncMain---begin&quot;);

    dispatch_queue_t queue = dispatch_get_main_queue();

    dispatch_sync(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    dispatch_sync(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 2
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;2---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    dispatch_sync(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 3
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;3---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    NSLog(@&quot;syncMain---end&quot;);
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;</p>
<pre><code>2019-08-08 14:43:58.062376+0800 YSC-GCD-demo[17371:4213562] currentThread---&lt;NSThread: 0x6000026e2940&gt;{number = 1, name = main}
2019-08-08 14:43:58.062518+0800 YSC-GCD-demo[17371:4213562] syncMain---begin
(lldb)
</code></pre><p>&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528; <strong>&#x540C;&#x6B65;&#x6267;&#x884C; + &#x4E3B;&#x961F;&#x5217;</strong> &#x53EF;&#x4EE5;&#x60CA;&#x5947;&#x7684;&#x53D1;&#x73B0;&#xFF1A;</p>
<ul>
<li>&#x8FFD;&#x52A0;&#x5230;&#x4E3B;&#x7EBF;&#x7A0B;&#x7684;&#x4EFB;&#x52A1; 1&#x3001;&#x4EFB;&#x52A1; 2&#x3001;&#x4EFB;&#x52A1; 3 &#x90FD;&#x4E0D;&#x518D;&#x6267;&#x884C;&#x4E86;&#xFF0C;&#x800C;&#x4E14; <strong>syncMain---end</strong> &#x4E5F;&#x6CA1;&#x6709;&#x6253;&#x5370;&#xFF0C;&#x5728; XCode 9 &#x53CA;&#x4EE5;&#x4E0A;&#x7248;&#x672C;&#x4E0A;&#x8FD8;&#x4F1A;&#x76F4;&#x63A5;&#x62A5;&#x5D29;&#x6E83;&#x3002;&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</li>
</ul>
<p>&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C; <strong>syncMain</strong> &#x65B9;&#x6CD5;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x628A; <strong>syncMain</strong>  &#x4EFB;&#x52A1;&#x653E;&#x5230;&#x4E86;&#x4E3B;&#x7EBF;&#x7A0B;&#x7684;&#x961F;&#x5217;&#x4E2D;&#x3002;&#x800C; &#x540C;&#x6B65;&#x6267;&#x884C; &#x4F1A;&#x7B49;&#x5F85;&#x5F53;&#x524D;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x624D;&#x4F1A;&#x63A5;&#x7740;&#x6267;&#x884C;&#x3002;&#x90A3;&#x4E48;&#x5F53;&#x6211;&#x4EEC;&#x628A; &#x4EFB;&#x52A1; 1 &#x8FFD;&#x52A0;&#x5230;&#x4E3B;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x4EFB;&#x52A1; 1 &#x5C31;&#x5728;&#x7B49;&#x5F85;&#x4E3B;&#x7EBF;&#x7A0B;&#x5904;&#x7406;&#x5B8C; <strong>syncMain</strong> &#x4EFB;&#x52A1;&#x3002;&#x800C;<strong>syncMain</strong> &#x4EFB;&#x52A1;&#x9700;&#x8981;&#x7B49;&#x5F85; &#x4EFB;&#x52A1; 1 &#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x624D;&#x80FD;&#x63A5;&#x7740;&#x6267;&#x884C;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x60C5;&#x51B5;&#x5C31;&#x662F; <strong>syncMain</strong> &#x4EFB;&#x52A1;&#x548C; &#x4EFB;&#x52A1; 1 &#x90FD;&#x5728;&#x7B49;&#x5BF9;&#x65B9;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x3002;&#x8FD9;&#x6837;&#x5927;&#x5BB6;&#x4E92;&#x76F8;&#x7B49;&#x5F85;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x5361;&#x4F4F;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x4E0D;&#x4E86;&#xFF0C;&#x800C;&#x4E14; <strong>syncMain---end</strong> &#x4E5F;&#x6CA1;&#x6709;&#x6253;&#x5370;&#x3002;</p>
<p><strong>&#x8981;&#x662F;&#x5982;&#x679C;&#x4E0D;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;&#xFF0C;&#x800C;&#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;&#x4F1A;&#x5982;&#x4F55;&#x5462;&#xFF1F;</strong></p>
<h4 id="452-&#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;&#x300E;&#x540C;&#x6B65;&#x6267;&#x884C;--&#x4E3B;&#x961F;&#x5217;&#x300F;">4.5.2 &#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;&#x300E;&#x540C;&#x6B65;&#x6267;&#x884C; + &#x4E3B;&#x961F;&#x5217;&#x300F;</h4>
<ul>
<li>&#x4E0D;&#x4F1A;&#x5F00;&#x542F;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;</li>
</ul>
<pre><code>// &#x4F7F;&#x7528; NSThread &#x7684; detachNewThreadSelector &#x65B9;&#x6CD5;&#x4F1A;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#xFF0C;&#x5E76;&#x81EA;&#x52A8;&#x542F;&#x52A8;&#x7EBF;&#x7A0B;&#x6267;&#x884C; selector &#x4EFB;&#x52A1;
[NSThread detachNewThreadSelector:@selector(syncMain) toTarget:self withObject:nil];
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre><code>2019-08-08 14:51:38.137978+0800 YSC-GCD-demo[17482:4237818] currentThread---&lt;NSThread: 0x600001dd6c00&gt;{number = 3, name = (null)}
2019-08-08 14:51:38.138159+0800 YSC-GCD-demo[17482:4237818] syncMain---begin
2019-08-08 14:51:40.149065+0800 YSC-GCD-demo[17482:4237594] 1---&lt;NSThread: 0x600001d8d380&gt;{number = 1, name = main}
2019-08-08 14:51:42.151104+0800 YSC-GCD-demo[17482:4237594] 2---&lt;NSThread: 0x600001d8d380&gt;{number = 1, name = main}
2019-08-08 14:51:44.152583+0800 YSC-GCD-demo[17482:4237594] 3---&lt;NSThread: 0x600001d8d380&gt;{number = 1, name = main}
2019-08-08 14:51:44.152767+0800 YSC-GCD-demo[17482:4237818] syncMain---end
</code></pre><p>&#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528; <strong>&#x540C;&#x6B65;&#x6267;&#x884C; + &#x4E3B;&#x961F;&#x5217;</strong> &#x53EF;&#x770B;&#x5230;&#xFF1A;</p>
<p>&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x662F;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF08;&#x975E;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF09;&#x4E2D;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x5F00;&#x542F;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#xFF08;&#x6240;&#x6709;&#x653E;&#x5728;<strong>&#x4E3B;&#x961F;&#x5217;</strong>&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x90FD;&#x4F1A;&#x653E;&#x5230;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#xFF09;&#x3002;
&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x5728;&#x6253;&#x5370;&#x7684; <strong>syncConcurrent---begin</strong> &#x548C; <strong>syncConcurrent---end</strong> &#x4E4B;&#x95F4;&#x6267;&#x884C;&#xFF08;&#x540C;&#x6B65;&#x4EFB;&#x52A1; &#x9700;&#x8981;&#x7B49;&#x5F85;&#x961F;&#x5217;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7ED3;&#x675F;&#xFF09;&#x3002;
&#x4EFB;&#x52A1;&#x662F;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#xFF08;&#x4E3B;&#x961F;&#x5217;&#x662F; <strong>&#x4E32;&#x884C;&#x961F;&#x5217;</strong>&#xFF0C;&#x6BCF;&#x6B21;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x88AB;&#x6267;&#x884C;&#xFF0C;&#x4EFB;&#x52A1;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF09;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x73B0;&#x5728;&#x5C31;&#x4E0D;&#x4F1A;&#x5361;&#x4F4F;&#x4E86;&#x5462;&#xFF1F;
&#x56E0;&#x4E3A;<strong>syncMain</strong> &#x4EFB;&#x52A1; &#x653E;&#x5230;&#x4E86;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x91CC;&#xFF0C;&#x800C; <strong>&#x4EFB;&#x52A1; 1</strong>&#x3001;<strong>&#x4EFB;&#x52A1; 2</strong>&#x3001;<strong>&#x4EFB;&#x52A1;3</strong> &#x90FD;&#x5728;&#x8FFD;&#x52A0;&#x5230;&#x4E3B;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E09;&#x4E2A;&#x4EFB;&#x52A1;&#x90FD;&#x4F1A;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x3002;<strong>syncMain</strong> &#x4EFB;&#x52A1; &#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x5230;&#x8FFD;&#x52A0; <strong>&#x4EFB;&#x52A1; 1</strong> &#x5230;&#x4E3B;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x4E3B;&#x961F;&#x5217;&#x73B0;&#x5728;&#x6CA1;&#x6709;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4F1A;&#x76F4;&#x63A5;&#x6267;&#x884C;&#x4E3B;&#x961F;&#x5217;&#x7684; &#x4EFB;&#x52A1;1&#xFF0C;&#x7B49; &#x4EFB;&#x52A1;1 &#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x518D;&#x63A5;&#x7740;&#x6267;&#x884C; <strong>&#x4EFB;&#x52A1; 2</strong>&#x3001;<strong>&#x4EFB;&#x52A1; 3</strong>&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x4E0D;&#x4F1A;&#x5361;&#x4F4F;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E5F;&#x5C31;&#x4E0D;&#x4F1A;&#x9020;&#x6210;&#x6B7B;&#x9501;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="46-&#x5F02;&#x6B65;&#x6267;&#x884C;--&#x4E3B;&#x961F;&#x5217;">4.6 &#x5F02;&#x6B65;&#x6267;&#x884C; + &#x4E3B;&#x961F;&#x5217;</h3>
<p>&#x53EA;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;</p>
<pre><code>/**
 * &#x5F02;&#x6B65;&#x6267;&#x884C; + &#x4E3B;&#x961F;&#x5217;
 * &#x7279;&#x70B9;&#xFF1A;&#x53EA;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;
 */
- (void)asyncMain {
    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;asyncMain---begin&quot;);

    dispatch_queue_t queue = dispatch_get_main_queue();

    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 2
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;2---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 3
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;3---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    NSLog(@&quot;asyncMain---end&quot;);
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre><code>2019-08-08 14:53:27.023091+0800 YSC-GCD-demo[17521:4243690] currentThread---&lt;NSThread: 0x6000022a1380&gt;{number = 1, name = main}
2019-08-08 14:53:27.023247+0800 YSC-GCD-demo[17521:4243690] asyncMain---begin
2019-08-08 14:53:27.023399+0800 YSC-GCD-demo[17521:4243690] asyncMain---end
2019-08-08 14:53:29.035565+0800 YSC-GCD-demo[17521:4243690] 1---&lt;NSThread: 0x6000022a1380&gt;{number = 1, name = main}
2019-08-08 14:53:31.036565+0800 YSC-GCD-demo[17521:4243690] 2---&lt;NSThread: 0x6000022a1380&gt;{number = 1, name = main}
2019-08-08 14:53:33.037092+0800 YSC-GCD-demo[17521:4243690] 3---&lt;NSThread: 0x6000022a1380&gt;{number = 1, name = main}
</code></pre><p>&#x5728; <strong>&#x5F02;&#x6B65;&#x6267;&#x884C; + &#x4E3B;&#x961F;&#x5217;</strong> &#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF1A;</p>
<p>&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x662F;&#x5728;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF08;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF09;&#x4E2D;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5F00;&#x542F;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#xFF08;&#x867D;&#x7136; <strong>&#x5F02;&#x6B65;&#x6267;&#x884C;</strong> &#x5177;&#x5907;&#x5F00;&#x542F;&#x7EBF;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x56E0;&#x4E3A;&#x662F;&#x4E3B;&#x961F;&#x5217;&#xFF0C;&#x6240;&#x4EE5;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF09;&#x3002;
&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x662F;&#x5728;&#x6253;&#x5370;&#x7684; <strong>syncConcurrent---begin</strong> &#x548C; <strong>syncConcurrent---end</strong> &#x4E4B;&#x540E;&#x624D;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x7684;&#xFF08;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x4E0D;&#x4F1A;&#x505A;&#x4EFB;&#x4F55;&#x7B49;&#x5F85;&#xFF0C;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF09;&#x3002;
&#x4EFB;&#x52A1;&#x662F;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#xFF08;&#x56E0;&#x4E3A;&#x4E3B;&#x961F;&#x5217;&#x662F; <strong>&#x4E32;&#x884C;&#x961F;&#x5217;</strong>&#xFF0C;&#x6BCF;&#x6B21;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x88AB;&#x6267;&#x884C;&#xFF0C;&#x4EFB;&#x52A1;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF09;&#x3002;</p>
<p>&#x5F04;&#x61C2;&#x4E86;&#x96BE;&#x7406;&#x89E3;&#x3001;&#x7ED5;&#x6765;&#x7ED5;&#x53BB;&#x7684;<strong>&#x300E;&#x4E0D;&#x540C;&#x961F;&#x5217;&#x300F;+&#x300E;&#x4E0D;&#x540C;&#x4EFB;&#x52A1;&#x300F;</strong>&#x4F7F;&#x7528;&#x533A;&#x522B;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#xFF1A;<strong>5. GCD &#x7EBF;&#x7A0B;&#x95F4;&#x7684;&#x901A;&#x4FE1;</strong>&#x3002;</p>
<h2 id="5-gcd-&#x7EBF;&#x7A0B;&#x95F4;&#x7684;&#x901A;&#x4FE1;">5. GCD &#x7EBF;&#x7A0B;&#x95F4;&#x7684;&#x901A;&#x4FE1;</h2>
<p>&#x5728; iOS &#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x91CC;&#x8FB9;&#x8FDB;&#x884C; UI &#x5237;&#x65B0;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x70B9;&#x51FB;&#x3001;&#x6EDA;&#x52A8;&#x3001;&#x62D6;&#x62FD;&#x7B49;&#x4E8B;&#x4EF6;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x628A;&#x4E00;&#x4E9B;&#x8017;&#x65F6;&#x7684;&#x64CD;&#x4F5C;&#x653E;&#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x56FE;&#x7247;&#x4E0B;&#x8F7D;&#x3001;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#x7B49;&#x8017;&#x65F6;&#x64CD;&#x4F5C;&#x3002;&#x800C;&#x5F53;&#x6211;&#x4EEC;&#x6709;&#x65F6;&#x5019;&#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x5B8C;&#x6210;&#x4E86;&#x8017;&#x65F6;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x56DE;&#x5230;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x7528;&#x5230;&#x4E86;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x8BAF;&#x3002;</p>
<pre><code>/**
 * &#x7EBF;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;
 */
- (void)communication {
    // &#x83B7;&#x53D6;&#x5168;&#x5C40;&#x5E76;&#x53D1;&#x961F;&#x5217;
    dispatch_queue_t queue = dispatch_get_global_queue(DISPATCH_QUEUE_PRIORITY_DEFAULT, 0);
    // &#x83B7;&#x53D6;&#x4E3B;&#x961F;&#x5217;
    dispatch_queue_t mainQueue = dispatch_get_main_queue();

    dispatch_async(queue, ^{
        // &#x5F02;&#x6B65;&#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;

        // &#x56DE;&#x5230;&#x4E3B;&#x7EBF;&#x7A0B;
        dispatch_async(mainQueue, ^{
            // &#x8FFD;&#x52A0;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;
            [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
            NSLog(@&quot;2---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
        });
    });
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre><code>2019-08-08 14:56:22.973318+0800 YSC-GCD-demo[17573:4253201] 1---&lt;NSThread: 0x600001846080&gt;{number = 3, name = (null)}
2019-08-08 14:56:24.973902+0800 YSC-GCD-demo[17573:4253108] 2---&lt;NSThread: 0x60000181e940&gt;{number = 1, name = main}
</code></pre><ul>
<li>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E2D;&#x5148;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x4E86;&#x4E4B;&#x540E;&#x56DE;&#x5230;&#x4E3B;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x4E3B;&#x7EBF;&#x7A0B;&#x7684;&#x76F8;&#x5E94;&#x64CD;&#x4F5C;&#x3002;</li>
</ul>
<h2 id="6-gcd-&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;">6. GCD &#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;</h2>
<h3 id="61-gcd-&#x6805;&#x680F;&#x65B9;&#x6CD5;&#xFF1A;dispatchbarrierasync">6.1 GCD &#x6805;&#x680F;&#x65B9;&#x6CD5;&#xFF1A;dispatch_barrier_async</h3>
<ul>
<li>&#x6211;&#x4EEC;&#x6709;&#x65F6;&#x9700;&#x8981;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x4E24;&#x7EC4;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x4E14;&#x7B2C;&#x4E00;&#x7EC4;&#x64CD;&#x4F5C;&#x6267;&#x884C;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x7B2C;&#x4E8C;&#x7EC4;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x4E8E; <strong>&#x6805;&#x680F;</strong> &#x4E00;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5C06;&#x4E24;&#x7EC4;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x7EC4;&#x7ED9;&#x5206;&#x5272;&#x8D77;&#x6765;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x91CC;&#x7684;&#x64CD;&#x4F5C;&#x7EC4;&#x91CC;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x7528;&#x5230; <strong>dispatch_barrier_async</strong> &#x65B9;&#x6CD5;&#x5728;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x7EC4;&#x95F4;&#x5F62;&#x6210;&#x6805;&#x680F;&#x3002;</li>
</ul>
<p><strong>dispatch_barrier_async</strong> &#x65B9;&#x6CD5;&#x4F1A;&#x7B49;&#x5F85;&#x524D;&#x8FB9;&#x8FFD;&#x52A0;&#x5230;&#x5E76;&#x53D1;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x5168;&#x90E8;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x5C06;&#x6307;&#x5B9A;&#x7684;&#x4EFB;&#x52A1;&#x8FFD;&#x52A0;&#x5230;&#x8BE5;&#x5F02;&#x6B65;&#x961F;&#x5217;&#x4E2D;&#x3002;&#x7136;&#x540E;&#x5728; <strong>dispatch_barrier_async</strong> &#x65B9;&#x6CD5;&#x8FFD;&#x52A0;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;&#xFF0C;&#x5F02;&#x6B65;&#x961F;&#x5217;&#x624D;&#x6062;&#x590D;&#x4E3A;&#x4E00;&#x822C;&#x52A8;&#x4F5C;&#xFF0C;&#x63A5;&#x7740;&#x8FFD;&#x52A0;&#x4EFB;&#x52A1;&#x5230;&#x8BE5;&#x5F02;&#x6B65;&#x961F;&#x5217;&#x5E76;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x3002;&#x5177;&#x4F53;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="https://s11.mogucdn.com/mlcdn/c45406/210311_28lllb4hf45dfc6jagk5baj1fbjbf_1242x634.png" alt=""></p>
<pre><code>/**
 * &#x6805;&#x680F;&#x65B9;&#x6CD5; dispatch_barrier_async
 */
- (void)barrier {
    dispatch_queue_t queue = dispatch_queue_create(&quot;net.bujige.testQueue&quot;, DISPATCH_QUEUE_CONCURRENT);

    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });
    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 2
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;2---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    dispatch_barrier_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; barrier
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;barrier---%@&quot;,[NSThread currentThread]);// &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 3
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;3---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });
    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 4
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;4---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre><code>2019-08-08 14:59:02.540868+0800 YSC-GCD-demo[17648:4262933] 1---&lt;NSThread: 0x600001ca4c40&gt;{number = 3, name = (null)}
2019-08-08 14:59:02.540868+0800 YSC-GCD-demo[17648:4262932] 2---&lt;NSThread: 0x600001c84a00&gt;{number = 4, name = (null)}
2019-08-08 14:59:04.542346+0800 YSC-GCD-demo[17648:4262933] barrier---&lt;NSThread: 0x600001ca4c40&gt;{number = 3, name = (null)}
2019-08-08 14:59:06.542772+0800 YSC-GCD-demo[17648:4262932] 4---&lt;NSThread: 0x600001c84a00&gt;{number = 4, name = (null)}
2019-08-08 14:59:06.542773+0800 YSC-GCD-demo[17648:4262933] 3---&lt;NSThread: 0x600001ca4c40&gt;{number = 3, name = (null)}
</code></pre><p>&#x5728; <strong>dispatch_barrier_async</strong> &#x6267;&#x884C;&#x7ED3;&#x679C;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x6267;&#x884C;&#x5B8C;&#x6805;&#x680F;&#x524D;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x6267;&#x884C;&#x6805;&#x680F;&#x64CD;&#x4F5C;&#xFF0C;&#x6700;&#x540E;&#x518D;&#x6267;&#x884C;&#x6805;&#x680F;&#x540E;&#x8FB9;&#x7684;&#x64CD;&#x4F5C;&#x3002;</li>
</ul>
<h3 id="62-gcd-&#x5EF6;&#x65F6;&#x6267;&#x884C;&#x65B9;&#x6CD5;&#xFF1A;dispatchafter">6.2 GCD &#x5EF6;&#x65F6;&#x6267;&#x884C;&#x65B9;&#x6CD5;&#xFF1A;dispatch_after</h3>
<p>&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F1A;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x9700;&#x6C42;&#xFF1A;&#x5728;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#xFF08;&#x4F8B;&#x5982; 3 &#x79D2;&#xFF09;&#x4E4B;&#x540E;&#x6267;&#x884C;&#x67D0;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x53EF;&#x4EE5;&#x7528; GCD &#x7684; <strong>dispatch_after</strong> &#x65B9;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x3002;
&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF1A;<strong>dispatch_after</strong> &#x65B9;&#x6CD5;&#x5E76;&#x4E0D;&#x662F;&#x5728;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#x624D;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#x5C06;&#x4EFB;&#x52A1;&#x8FFD;&#x52A0;&#x5230;&#x4E3B;&#x961F;&#x5217;&#x4E2D;&#x3002;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x5E76;&#x4E0D;&#x662F;&#x7EDD;&#x5BF9;&#x51C6;&#x786E;&#x7684;&#xFF0C;&#x4F46;&#x60F3;&#x8981;&#x5927;&#x81F4;&#x5EF6;&#x8FDF;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;<strong>dispatch_after</strong> &#x65B9;&#x6CD5;&#x662F;&#x5F88;&#x6709;&#x6548;&#x7684;&#x3002;</p>
<pre><code>/**
 * &#x5EF6;&#x65F6;&#x6267;&#x884C;&#x65B9;&#x6CD5; dispatch_after
 */
- (void)after {
    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;asyncMain---begin&quot;);

    dispatch_after(dispatch_time(DISPATCH_TIME_NOW, (int64_t)(2.0 * NSEC_PER_SEC)), dispatch_get_main_queue(), ^{
        // 2.0 &#x79D2;&#x540E;&#x5F02;&#x6B65;&#x8FFD;&#x52A0;&#x4EFB;&#x52A1;&#x4EE3;&#x7801;&#x5230;&#x4E3B;&#x961F;&#x5217;&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x6267;&#x884C;
        NSLog(@&quot;after---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre><code>2019-08-08 15:01:33.569710+0800 YSC-GCD-demo[17702:4272430] currentThread---&lt;NSThread: 0x600001ead340&gt;{number = 1, name = main}
2019-08-08 15:01:33.569838+0800 YSC-GCD-demo[17702:4272430] asyncMain---begin
2019-08-08 15:01:35.570146+0800 YSC-GCD-demo[17702:4272430] after---&lt;NSThread: 0x600001ead340&gt;{number = 1, name = main}
&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF1A;&#x5728;&#x6253;&#x5370; asyncMain---begin &#x4E4B;&#x540E;&#x5927;&#x7EA6; 2.0 &#x79D2;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6253;&#x5370;&#x4E86; after---&lt;NSThread: 0x600001ead340&gt;{number = 1, name = main}
</code></pre><h3 id="63-gcd-&#x4E00;&#x6B21;&#x6027;&#x4EE3;&#x7801;&#xFF08;&#x53EA;&#x6267;&#x884C;&#x4E00;&#x6B21;&#xFF09;&#xFF1A;dispatchonce">6.3 GCD &#x4E00;&#x6B21;&#x6027;&#x4EE3;&#x7801;&#xFF08;&#x53EA;&#x6267;&#x884C;&#x4E00;&#x6B21;&#xFF09;&#xFF1A;dispatch_once</h3>
<p>&#x6211;&#x4EEC;&#x5728;&#x521B;&#x5EFA;&#x5355;&#x4F8B;&#x3001;&#x6216;&#x8005;&#x6709;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EA;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x7528;&#x5230;&#x4E86; GCD &#x7684; <strong>dispatch_once</strong> &#x65B9;&#x6CD5;&#x3002;&#x4F7F;&#x7528; <strong>dispatch_once</strong> &#x65B9;&#x6CD5;&#x80FD;&#x4FDD;&#x8BC1;&#x67D0;&#x6BB5;&#x4EE3;&#x7801;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EA;&#x88AB;&#x6267;&#x884C; 1 &#x6B21;&#xFF0C;&#x5E76;&#x4E14;&#x5373;&#x4F7F;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;dispatch_once &#x4E5F;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3002;</p>
<pre><code>/**
 * &#x4E00;&#x6B21;&#x6027;&#x4EE3;&#x7801;&#xFF08;&#x53EA;&#x6267;&#x884C;&#x4E00;&#x6B21;&#xFF09;dispatch_once
 */
- (void)once {
    static dispatch_once_t onceToken;
    dispatch_once(&amp;onceToken, ^{
        // &#x53EA;&#x6267;&#x884C; 1 &#x6B21;&#x7684;&#x4EE3;&#x7801;&#xFF08;&#x8FD9;&#x91CC;&#x9762;&#x9ED8;&#x8BA4;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF09;
    });
}
</code></pre><h3 id="65-gcd-&#x961F;&#x5217;&#x7EC4;&#xFF1A;dispatchgroup">6.5 GCD &#x961F;&#x5217;&#x7EC4;&#xFF1A;dispatch_group</h3>
<p>&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4F1A;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x9700;&#x6C42;&#xFF1A;&#x5206;&#x522B;&#x5F02;&#x6B65;&#x6267;&#x884C;2&#x4E2A;&#x8017;&#x65F6;&#x4EFB;&#x52A1;&#xFF0C;&#x7136;&#x540E;&#x5F53;2&#x4E2A;&#x8017;&#x65F6;&#x4EFB;&#x52A1;&#x90FD;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#x518D;&#x56DE;&#x5230;&#x4E3B;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x5230; GCD &#x7684;&#x961F;&#x5217;&#x7EC4;&#x3002;</p>
<ul>
<li>&#x8C03;&#x7528;&#x961F;&#x5217;&#x7EC4;&#x7684; <strong>dispatch_group_async</strong> &#x5148;&#x628A;&#x4EFB;&#x52A1;&#x653E;&#x5230;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x961F;&#x5217;&#x653E;&#x5165;&#x961F;&#x5217;&#x7EC4;&#x4E2D;&#x3002;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x961F;&#x5217;&#x7EC4;&#x7684; <strong>dispatch_group_enter</strong>&#x3001;<strong>dispatch_group_leave</strong> &#x7EC4;&#x5408;&#x6765;&#x5B9E;&#x73B0; <strong>dispatch_group_async</strong>&#x3002;</li>
<li>&#x8C03;&#x7528;&#x961F;&#x5217;&#x7EC4;&#x7684; <strong>dispatch_group_notify</strong> &#x56DE;&#x5230;&#x6307;&#x5B9A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x6216;&#x8005;&#x4F7F;&#x7528; <strong>dispatch_group_wait</strong>  &#x56DE;&#x5230;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7EE7;&#x7EED;&#x5411;&#x4E0B;&#x6267;&#x884C;&#xFF08;&#x4F1A;&#x963B;&#x585E;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF09;&#x3002;</li>
</ul>
<h4 id="651-dispatchgroupnotify">6.5.1 dispatch_group_notify</h4>
<ul>
<li>&#x76D1;&#x542C; group &#x4E2D;&#x4EFB;&#x52A1;&#x7684;&#x5B8C;&#x6210;&#x72B6;&#x6001;&#xFF0C;&#x5F53;&#x6240;&#x6709;&#x7684;&#x4EFB;&#x52A1;&#x90FD;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x8FFD;&#x52A0;&#x4EFB;&#x52A1;&#x5230; group &#x4E2D;&#xFF0C;&#x5E76;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;</li>
</ul>
<pre><code>/**
 * &#x961F;&#x5217;&#x7EC4; dispatch_group_notify
 */
- (void)groupNotify {
    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;group---begin&quot;);

    dispatch_group_t group =  dispatch_group_create();

    dispatch_group_async(group, dispatch_get_global_queue(DISPATCH_QUEUE_PRIORITY_DEFAULT, 0), ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    dispatch_group_async(group, dispatch_get_global_queue(DISPATCH_QUEUE_PRIORITY_DEFAULT, 0), ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 2
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;2---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    dispatch_group_notify(group, dispatch_get_main_queue(), ^{
        // &#x7B49;&#x524D;&#x9762;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1; 1&#x3001;&#x4EFB;&#x52A1; 2 &#x90FD;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x56DE;&#x5230;&#x4E3B;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x4E0B;&#x8FB9;&#x4EFB;&#x52A1;
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;3---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;

        NSLog(@&quot;group---end&quot;);
    });
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre><code>2019-08-08 15:07:21.601734+0800 YSC-GCD-demo[17813:4293874] currentThread---&lt;NSThread: 0x600003aad380&gt;{number = 1, name = main}
2019-08-08 15:07:21.601871+0800 YSC-GCD-demo[17813:4293874] group---begin
2019-08-08 15:07:23.604854+0800 YSC-GCD-demo[17813:4294048] 2---&lt;NSThread: 0x600003add100&gt;{number = 4, name = (null)}
2019-08-08 15:07:23.604852+0800 YSC-GCD-demo[17813:4294053] 1---&lt;NSThread: 0x600003ace4c0&gt;{number = 3, name = (null)}
2019-08-08 15:07:25.606067+0800 YSC-GCD-demo[17813:4293874] 3---&lt;NSThread: 0x600003aad380&gt;{number = 1, name = main}
2019-08-08 15:07:25.606255+0800 YSC-GCD-demo[17813:4293874] group---end
</code></pre><p>&#x4ECE; <strong>dispatch_group_notify</strong> &#x76F8;&#x5173;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF1A; &#x5F53;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x6267;&#x884C; <strong>dispatch_group_notify</strong> &#x76F8;&#x5173; block &#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
<h4 id="652-dispatchgroupwait">6.5.2 dispatch_group_wait</h4>
<ul>
<li>&#x6682;&#x505C;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF08;&#x963B;&#x585E;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF09;&#xFF0C;&#x7B49;&#x5F85;&#x6307;&#x5B9A;&#x7684; group &#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x624D;&#x4F1A;&#x5F80;&#x4E0B;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;</li>
</ul>
<pre><code>/**
 * &#x961F;&#x5217;&#x7EC4; dispatch_group_wait
 */
- (void)groupWait {
    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;group---begin&quot;);

    dispatch_group_t group =  dispatch_group_create();

    dispatch_group_async(group, dispatch_get_global_queue(DISPATCH_QUEUE_PRIORITY_DEFAULT, 0), ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    dispatch_group_async(group, dispatch_get_global_queue(DISPATCH_QUEUE_PRIORITY_DEFAULT, 0), ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 2
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;2---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    });

    // &#x7B49;&#x5F85;&#x4E0A;&#x9762;&#x7684;&#x4EFB;&#x52A1;&#x5168;&#x90E8;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x4F1A;&#x5F80;&#x4E0B;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF08;&#x4F1A;&#x963B;&#x585E;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF09;
    dispatch_group_wait(group, DISPATCH_TIME_FOREVER);

    NSLog(@&quot;group---end&quot;);

}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre><code>2019-08-08 15:09:12.441729+0800 YSC-GCD-demo[17844:4299926] currentThread---&lt;NSThread: 0x6000013e2940&gt;{number = 1, name = main}
2019-08-08 15:09:12.441870+0800 YSC-GCD-demo[17844:4299926] group---begin
2019-08-08 15:09:14.445790+0800 YSC-GCD-demo[17844:4300046] 2---&lt;NSThread: 0x600001389780&gt;{number = 4, name = (null)}
2019-08-08 15:09:14.445760+0800 YSC-GCD-demo[17844:4300043] 1---&lt;NSThread: 0x600001381880&gt;{number = 3, name = (null)}
2019-08-08 15:09:14.446039+0800 YSC-GCD-demo[17844:4299926] group---end
</code></pre><p>&#x4ECE; <strong>dispatch_group_wait</strong> &#x76F8;&#x5173;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF1A;
&#x5F53;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x6267;&#x884C; <strong>dispatch_group_wait</strong> &#x4E4B;&#x540E;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F7F;&#x7528; <strong>dispatch_group_wait</strong> &#x4F1A;&#x963B;&#x585E;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x3002;</p>
<h4 id="653-dispatchgroupenter&#x3001;dispatchgroupleave">6.5.3 dispatch_group_enter&#x3001;dispatch_group_leave</h4>
<ul>
<li>dispatch_group_enter &#x6807;&#x5FD7;&#x7740;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x8FFD;&#x52A0;&#x5230; group&#xFF0C;&#x6267;&#x884C;&#x4E00;&#x6B21;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E; group &#x4E2D;&#x672A;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x4EFB;&#x52A1;&#x6570; +1</li>
<li>dispatch_group_leave &#x6807;&#x5FD7;&#x7740;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x79BB;&#x5F00;&#x4E86; group&#xFF0C;&#x6267;&#x884C;&#x4E00;&#x6B21;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E; group &#x4E2D;&#x672A;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x4EFB;&#x52A1;&#x6570; -1&#x3002;</li>
<li>&#x5F53; group &#x4E2D;&#x672A;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x4EFB;&#x52A1;&#x6570;&#x4E3A;0&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x4F1A;&#x4F7F; dispatch_group_wait &#x89E3;&#x9664;&#x963B;&#x585E;&#xFF0C;&#x4EE5;&#x53CA;&#x6267;&#x884C;&#x8FFD;&#x52A0;&#x5230; dispatch_group_notify &#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x3002;</li>
</ul>
<pre><code>/**
 * &#x961F;&#x5217;&#x7EC4; dispatch_group_enter&#x3001;dispatch_group_leave
 */
- (void)groupEnterAndLeave {
    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;group---begin&quot;);

    dispatch_group_t group = dispatch_group_create();
    dispatch_queue_t queue = dispatch_get_global_queue(DISPATCH_QUEUE_PRIORITY_DEFAULT, 0);
    dispatch_group_enter(group);
    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;

        dispatch_group_leave(group);
    });

    dispatch_group_enter(group);
    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 2
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;2---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;

        dispatch_group_leave(group);
    });

    dispatch_group_notify(group, dispatch_get_main_queue(), ^{
        // &#x7B49;&#x524D;&#x9762;&#x7684;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#x90FD;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x56DE;&#x5230;&#x4E3B;&#x7EBF;&#x7A0B;.
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;3---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;

        NSLog(@&quot;group---end&quot;);
    });
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre><code>2019-08-08 15:13:17.983283+0800 YSC-GCD-demo[17924:4314716] currentThread---&lt;NSThread: 0x600001ee5380&gt;{number = 1, name = main}
2019-08-08 15:13:17.983429+0800 YSC-GCD-demo[17924:4314716] group---begin
2019-08-08 15:13:19.988898+0800 YSC-GCD-demo[17924:4314816] 2---&lt;NSThread: 0x600001e9ca00&gt;{number = 3, name = (null)}
2019-08-08 15:13:19.988888+0800 YSC-GCD-demo[17924:4314808] 1---&lt;NSThread: 0x600001e94100&gt;{number = 4, name = (null)}
2019-08-08 15:13:21.990450+0800 YSC-GCD-demo[17924:4314716] 3---&lt;NSThread: 0x600001ee5380&gt;{number = 1, name = main}
2019-08-08 15:13:21.990711+0800 YSC-GCD-demo[17924:4314716] group---end
</code></pre><p>&#x4ECE; dispatch_group_enter&#x3001;dispatch_group_leave &#x76F8;&#x5173;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF1A;&#x5F53;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x6267;&#x884C; <strong>dispatch_group_notify</strong> &#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x8FD9;&#x91CC;&#x7684;<strong>dispatch_group_enter</strong>&#x3001;<strong>dispatch_group_leave</strong> &#x7EC4;&#x5408;&#xFF0C;&#x5176;&#x5B9E;&#x7B49;&#x540C;&#x4E8E;<strong>dispatch_group_async</strong>&#x3002;</p>
<h3 id="66-gcd-&#x4FE1;&#x53F7;&#x91CF;&#xFF1A;dispatchsemaphore">6.6 GCD &#x4FE1;&#x53F7;&#x91CF;&#xFF1A;dispatch_semaphore</h3>
<p>GCD &#x4E2D;&#x7684;&#x4FE1;&#x53F7;&#x91CF;&#x662F;&#x6307; Dispatch Semaphore&#xFF0C;&#x662F;&#x6301;&#x6709;&#x8BA1;&#x6570;&#x7684;&#x4FE1;&#x53F7;&#x3002;&#x7C7B;&#x4F3C;&#x4E8E;&#x8FC7;&#x9AD8;&#x901F;&#x8DEF;&#x6536;&#x8D39;&#x7AD9;&#x7684;&#x680F;&#x6746;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x65F6;&#xFF0C;&#x6253;&#x5F00;&#x680F;&#x6746;&#xFF0C;&#x4E0D;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x65F6;&#xFF0C;&#x5173;&#x95ED;&#x680F;&#x6746;&#x3002;&#x5728; Dispatch Semaphore &#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x8BA1;&#x6570;&#x6765;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x8BA1;&#x6570;&#x5C0F;&#x4E8E; 0 &#x65F6;&#x7B49;&#x5F85;&#xFF0C;&#x4E0D;&#x53EF;&#x901A;&#x8FC7;&#x3002;&#x8BA1;&#x6570;&#x4E3A; 0 &#x6216;&#x5927;&#x4E8E; 0 &#x65F6;&#xFF0C;&#x8BA1;&#x6570;&#x51CF; 1 &#x4E14;&#x4E0D;&#x7B49;&#x5F85;&#xFF0C;&#x53EF;&#x901A;&#x8FC7;&#x3002;
Dispatch Semaphore &#x63D0;&#x4F9B;&#x4E86;&#x4E09;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ul>
<li>dispatch_semaphore_create&#xFF1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; Semaphore &#x5E76;&#x521D;&#x59CB;&#x5316;&#x4FE1;&#x53F7;&#x7684;&#x603B;&#x91CF;</li>
<li>dispatch_semaphore_signal&#xFF1A;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#xFF0C;&#x8BA9;&#x4FE1;&#x53F7;&#x603B;&#x91CF;&#x52A0; 1</li>
<li>dispatch_semaphore_wait&#xFF1A;&#x53EF;&#x4EE5;&#x4F7F;&#x603B;&#x4FE1;&#x53F7;&#x91CF;&#x51CF; 1&#xFF0C;&#x4FE1;&#x53F7;&#x603B;&#x91CF;&#x5C0F;&#x4E8E; 0 &#x65F6;&#x5C31;&#x4F1A;&#x4E00;&#x76F4;&#x7B49;&#x5F85;&#xFF08;&#x963B;&#x585E;&#x6240;&#x5728;&#x7EBF;&#x7A0B;&#xFF09;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x6267;&#x884C;&#x3002;</li>
</ul>
<pre><code>&#x6CE8;&#x610F;&#xFF1A;&#x4FE1;&#x53F7;&#x91CF;&#x7684;&#x4F7F;&#x7528;&#x524D;&#x63D0;&#x662F;&#xFF1A;&#x60F3;&#x6E05;&#x695A;&#x4F60;&#x9700;&#x8981;&#x5904;&#x7406;&#x54EA;&#x4E2A;&#x7EBF;&#x7A0B;&#x7B49;&#x5F85;&#xFF08;&#x963B;&#x585E;&#xFF09;&#xFF0C;&#x53C8;&#x8981;&#x54EA;&#x4E2A;&#x7EBF;&#x7A0B;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x4FE1;&#x53F7;&#x91CF;&#x3002;
</code></pre><p>Dispatch Semaphore &#x5728;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x4E2D;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#xFF1A;</p>
<ul>
<li>&#x4FDD;&#x6301;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#xFF0C;&#x5C06;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x8F6C;&#x6362;&#x4E3A;&#x540C;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;</li>
<li>&#x4FDD;&#x8BC1;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF0C;&#x4E3A;&#x7EBF;&#x7A0B;&#x52A0;&#x9501;</li>
</ul>
<h4 id="661-dispatch-semaphore-&#x7EBF;&#x7A0B;&#x540C;&#x6B65;">6.6.1 Dispatch Semaphore &#x7EBF;&#x7A0B;&#x540C;&#x6B65;</h4>
<p>&#x6211;&#x4EEC;&#x5728;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x4F1A;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x9700;&#x6C42;&#xFF1A;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x8017;&#x65F6;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#xFF0C;&#x5C06;&#x5C06;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x8F6C;&#x6362;&#x4E3A;&#x540C;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;AFNetworking &#x4E2D; AFURLSessionManager.m &#x91CC;&#x9762;&#x7684; <strong>tasksForKeyPath:</strong> &#x65B9;&#x6CD5;&#x3002;&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x4FE1;&#x53F7;&#x91CF;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7B49;&#x5F85;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x7ED3;&#x679C;&#xFF0C;&#x83B7;&#x53D6;&#x5230; tasks&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8FD4;&#x56DE;&#x8BE5; tasks&#x3002;</p>
<pre><code>- (NSArray *)tasksForKeyPath:(NSString *)keyPath {
    __block NSArray *tasks = nil;
    dispatch_semaphore_t semaphore = dispatch_semaphore_create(0);
    [self.session getTasksWithCompletionHandler:^(NSArray *dataTasks, NSArray *uploadTasks, NSArray *downloadTasks) {
        if ([keyPath isEqualToString:NSStringFromSelector(@selector(dataTasks))]) {
            tasks = dataTasks;
        } else if ([keyPath isEqualToString:NSStringFromSelector(@selector(uploadTasks))]) {
            tasks = uploadTasks;
        } else if ([keyPath isEqualToString:NSStringFromSelector(@selector(downloadTasks))]) {
            tasks = downloadTasks;
        } else if ([keyPath isEqualToString:NSStringFromSelector(@selector(tasks))]) {
            tasks = [@[dataTasks, uploadTasks, downloadTasks] valueForKeyPath:@&quot;@unionOfArrays.self&quot;];
        }

        dispatch_semaphore_signal(semaphore);
    }];

    dispatch_semaphore_wait(semaphore, DISPATCH_TIME_FOREVER);

    return tasks;
}
</code></pre><p>&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5229;&#x7528; Dispatch Semaphore &#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#xFF0C;&#x5C06;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x8F6C;&#x6362;&#x4E3A;&#x540C;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;</p>
<pre><code>/**
 * semaphore &#x7EBF;&#x7A0B;&#x540C;&#x6B65;
 */
- (void)semaphoreSync {

    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;semaphore---begin&quot;);

    dispatch_queue_t queue = dispatch_get_global_queue(DISPATCH_QUEUE_PRIORITY_DEFAULT, 0);
    dispatch_semaphore_t semaphore = dispatch_semaphore_create(0);

    __block int number = 0;
    dispatch_async(queue, ^{
        // &#x8FFD;&#x52A0;&#x4EFB;&#x52A1; 1
        [NSThread sleepForTimeInterval:2];              // &#x6A21;&#x62DF;&#x8017;&#x65F6;&#x64CD;&#x4F5C;
        NSLog(@&quot;1---%@&quot;,[NSThread currentThread]);      // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;

        number = 100;

        dispatch_semaphore_signal(semaphore);
    });

    dispatch_semaphore_wait(semaphore, DISPATCH_TIME_FOREVER);
    NSLog(@&quot;semaphore---end,number = %zd&quot;,number);
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;</p>
<pre><code>2019-08-08 15:16:56.781543+0800 YSC-GCD-demo[17988:4325744] currentThread---&lt;NSThread: 0x60000298d380&gt;{number = 1, name = main}
2019-08-08 15:16:56.781698+0800 YSC-GCD-demo[17988:4325744] semaphore---begin
2019-08-08 15:16:58.785232+0800 YSC-GCD-demo[17988:4325867] 1---&lt;NSThread: 0x6000029eba80&gt;{number = 3, name = (null)}
2019-08-08 15:16:58.785432+0800 YSC-GCD-demo[17988:4325744] semaphore---end,number = 100
</code></pre><p>&#x4ECE; Dispatch Semaphore &#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF1A;</p>
<ul>
<li><strong>semaphore---end</strong> &#x662F;&#x5728;&#x6267;&#x884C;&#x5B8C;  <strong>number = 100</strong>; &#x4E4B;&#x540E;&#x624D;&#x6253;&#x5370;&#x7684;&#x3002;&#x800C;&#x4E14;&#x8F93;&#x51FA;&#x7ED3;&#x679C; number &#x4E3A; 100&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A; &#x5F02;&#x6B65;&#x6267;&#x884C; &#x4E0D;&#x4F1A;&#x505A;&#x4EFB;&#x4F55;&#x7B49;&#x5F85;&#xFF0C;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;</li>
</ul>
<p>&#x6267;&#x884C;&#x987A;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>semaphore &#x521D;&#x59CB;&#x521B;&#x5EFA;&#x65F6;&#x8BA1;&#x6570;&#x4E3A; 0&#x3002;</li>
<li><strong>&#x5F02;&#x6B65;&#x6267;&#x884C;</strong> &#x5C06; <strong>&#x4EFB;&#x52A1; 1</strong> &#x8FFD;&#x52A0;&#x5230;&#x961F;&#x5217;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x505A;&#x7B49;&#x5F85;&#xFF0C;&#x63A5;&#x7740;&#x6267;&#x884C; <strong>dispatch_semaphore_wait</strong> &#x65B9;&#x6CD5;&#xFF0C;semaphore &#x51CF; 1&#xFF0C;&#x6B64;&#x65F6; <strong>semaphore == -1</strong>&#xFF0C;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x8FDB;&#x5165;&#x7B49;&#x5F85;&#x72B6;&#x6001;&#x3002;</li>
<li>&#x7136;&#x540E;&#xFF0C;&#x5F02;&#x6B65;&#x4EFB;&#x52A1; 1 &#x5F00;&#x59CB;&#x6267;&#x884C;&#x3002;&#x4EFB;&#x52A1; 1 &#x6267;&#x884C;&#x5230; <strong>dispatch_semaphore_signal</strong> &#x4E4B;&#x540E;&#xFF0C;&#x603B;&#x4FE1;&#x53F7;&#x91CF;&#x52A0; 1&#xFF0C;&#x6B64;&#x65F6; <strong>semaphore == 0</strong>&#xFF0C;&#x6B63;&#x5728;&#x88AB;&#x963B;&#x585E;&#x7684;&#x7EBF;&#x7A0B;&#xFF08;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF09;&#x6062;&#x590D;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;</li>
<li>&#x6700;&#x540E;&#x6253;&#x5370; <strong>semaphore---end,number = 100</strong>&#x3002;</li>
</ol>
<p>&#x8FD9;&#x6837;&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#xFF0C;&#x5C06;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x8F6C;&#x6362;&#x4E3A;&#x540C;&#x6B65;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;</p>
<h4 id="662-dispatch-semaphore-&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x548C;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#xFF08;&#x4E3A;&#x7EBF;&#x7A0B;&#x52A0;&#x9501;&#xFF09;">6.6.2 Dispatch Semaphore &#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x548C;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#xFF08;&#x4E3A;&#x7EBF;&#x7A0B;&#x52A0;&#x9501;&#xFF09;</h4>
<p><strong>&#x7EBF;&#x7A0B;&#x5B89;&#x5168;</strong>&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x6240;&#x5728;&#x7684;&#x8FDB;&#x7A0B;&#x4E2D;&#x6709;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x3002;&#x5982;&#x679C;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x548C;&#x5355;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5176;&#x4ED6;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x4E5F;&#x548C;&#x9884;&#x671F;&#x7684;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p>&#x82E5;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x5BF9;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3001;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x53EA;&#x6709;&#x8BFB;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x65E0;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF1B;&#x82E5;&#x6709;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x6267;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#xFF08;&#x66F4;&#x6539;&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x9700;&#x8981;&#x8003;&#x8651;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#xFF0C;&#x5426;&#x5219;&#x7684;&#x8BDD;&#x5C31;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3002;</p>
<p><strong>&#x7EBF;&#x7A0B;&#x540C;&#x6B65;</strong>&#xFF1A;&#x53EF;&#x7406;&#x89E3;&#x4E3A;&#x7EBF;&#x7A0B; A &#x548C; &#x7EBF;&#x7A0B; B &#x4E00;&#x5757;&#x914D;&#x5408;&#xFF0C;A &#x6267;&#x884C;&#x5230;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x65F6;&#x8981;&#x4F9D;&#x9760;&#x7EBF;&#x7A0B; B &#x7684;&#x67D0;&#x4E2A;&#x7ED3;&#x679C;&#xFF0C;&#x4E8E;&#x662F;&#x505C;&#x4E0B;&#x6765;&#xFF0C;&#x793A;&#x610F; B &#x8FD0;&#x884C;&#xFF1B;B &#x4F9D;&#x8A00;&#x6267;&#x884C;&#xFF0C;&#x518D;&#x5C06;&#x7ED3;&#x679C;&#x7ED9; A&#xFF1B;A &#x518D;&#x7EE7;&#x7EED;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#xFF1A;&#x4E24;&#x4E2A;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x804A;&#x5929;&#x3002;&#x4E24;&#x4E2A;&#x4EBA;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x8BF4;&#x8BDD;&#xFF0C;&#x907F;&#x514D;&#x542C;&#x4E0D;&#x6E05;(&#x64CD;&#x4F5C;&#x51B2;&#x7A81;)&#x3002;&#x7B49;&#x4E00;&#x4E2A;&#x4EBA;&#x8BF4;&#x5B8C;(&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7ED3;&#x675F;&#x64CD;&#x4F5C;)&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x518D;&#x8BF4;(&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x518D;&#x5F00;&#x59CB;&#x64CD;&#x4F5C;)&#x3002;</p>
<p>&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x6A21;&#x62DF;&#x706B;&#x8F66;&#x7968;&#x552E;&#x5356;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5B9E;&#x73B0; NSThread &#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x548C;&#x89E3;&#x51B3;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x95EE;&#x9898;&#x3002;</p>
<pre><code>&#x573A;&#x666F;&#xFF1A;&#x603B;&#x5171;&#x6709; 50 &#x5F20;&#x706B;&#x8F66;&#x7968;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x552E;&#x5356;&#x706B;&#x8F66;&#x7968;&#x7684;&#x7A97;&#x53E3;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x5317;&#x4EAC;&#x706B;&#x8F66;&#x7968;&#x552E;&#x5356;&#x7A97;&#x53E3;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x4E0A;&#x6D77;&#x706B;&#x8F66;&#x7968;&#x552E;&#x5356;&#x7A97;&#x53E3;&#x3002;&#x4E24;&#x4E2A;&#x7A97;&#x53E3;&#x540C;&#x65F6;&#x552E;&#x5356;&#x706B;&#x8F66;&#x7968;&#xFF0C;&#x5356;&#x5B8C;&#x4E3A;&#x6B62;&#x3002;
</code></pre><h5 id="6621-&#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF08;&#x4E0D;&#x4F7F;&#x7528;-semaphore&#xFF09;">6.6.2.1 &#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF08;&#x4E0D;&#x4F7F;&#x7528; semaphore&#xFF09;</h5>
<p>&#x5148;&#x6765;&#x770B;&#x770B;&#x4E0D;&#x8003;&#x8651;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>/**
 * &#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF1A;&#x4E0D;&#x4F7F;&#x7528; semaphore
 * &#x521D;&#x59CB;&#x5316;&#x706B;&#x8F66;&#x7968;&#x6570;&#x91CF;&#x3001;&#x5356;&#x7968;&#x7A97;&#x53E3;&#xFF08;&#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF09;&#x3001;&#x5E76;&#x5F00;&#x59CB;&#x5356;&#x7968;
 */
- (void)initTicketStatusNotSave {
    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;semaphore---begin&quot;);

    self.ticketSurplusCount = 50;

    // queue1 &#x4EE3;&#x8868;&#x5317;&#x4EAC;&#x706B;&#x8F66;&#x7968;&#x552E;&#x5356;&#x7A97;&#x53E3;
    dispatch_queue_t queue1 = dispatch_queue_create(&quot;net.bujige.testQueue1&quot;, DISPATCH_QUEUE_SERIAL);
    // queue2 &#x4EE3;&#x8868;&#x4E0A;&#x6D77;&#x706B;&#x8F66;&#x7968;&#x552E;&#x5356;&#x7A97;&#x53E3;
    dispatch_queue_t queue2 = dispatch_queue_create(&quot;net.bujige.testQueue2&quot;, DISPATCH_QUEUE_SERIAL);

    __weak typeof(self) weakSelf = self;
    dispatch_async(queue1, ^{
        [weakSelf saleTicketNotSafe];
    });

    dispatch_async(queue2, ^{
        [weakSelf saleTicketNotSafe];
    });
}

/**
 * &#x552E;&#x5356;&#x706B;&#x8F66;&#x7968;&#xFF08;&#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF09;
 */
- (void)saleTicketNotSafe {
    while (1) {

        if (self.ticketSurplusCount &gt; 0) {  // &#x5982;&#x679C;&#x8FD8;&#x6709;&#x7968;&#xFF0C;&#x7EE7;&#x7EED;&#x552E;&#x5356;
            self.ticketSurplusCount--;
            NSLog(@&quot;%@&quot;, [NSString stringWithFormat:@&quot;&#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;%d &#x7A97;&#x53E3;&#xFF1A;%@&quot;, self.ticketSurplusCount, [NSThread currentThread]]);
            [NSThread sleepForTimeInterval:0.2];
        } else { // &#x5982;&#x679C;&#x5DF2;&#x5356;&#x5B8C;&#xFF0C;&#x5173;&#x95ED;&#x552E;&#x7968;&#x7A97;&#x53E3;
            NSLog(@&quot;&#x6240;&#x6709;&#x706B;&#x8F66;&#x7968;&#x5747;&#x5DF2;&#x552E;&#x5B8C;&quot;);
            break;
        }

    }
}
</code></pre><pre><code>while (1) {

    if (self.ticketSurplusCount &gt; 0) {  // &#x5982;&#x679C;&#x8FD8;&#x6709;&#x7968;&#xFF0C;&#x7EE7;&#x7EED;&#x552E;&#x5356;
        self.ticketSurplusCount--;
        NSLog(@&quot;%@&quot;, [NSString stringWithFormat:@&quot;&#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;%d &#x7A97;&#x53E3;&#xFF1A;%@&quot;, self.ticketSurplusCount, [NSThread currentThread]]);
        [NSThread sleepForTimeInterval:0.2];
    } else { // &#x5982;&#x679C;&#x5DF2;&#x5356;&#x5B8C;&#xFF0C;&#x5173;&#x95ED;&#x552E;&#x7968;&#x7A97;&#x53E3;
        NSLog(@&quot;&#x6240;&#x6709;&#x706B;&#x8F66;&#x7968;&#x5747;&#x5DF2;&#x552E;&#x5B8C;&quot;);
        break;
    }

}
</code></pre><p>}</p>
<p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF08;&#x90E8;&#x5206;&#xFF09;&#xFF1A;</p>
<pre><code>2019-08-08 15:21:39.772655+0800 YSC-GCD-demo[18071:4340555] currentThread---&lt;NSThread: 0x6000015a2f40&gt;{number = 1, name = main}
2019-08-08 15:21:39.772790+0800 YSC-GCD-demo[18071:4340555] semaphore---begin
2019-08-08 15:21:39.773101+0800 YSC-GCD-demo[18071:4340604] &#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;48 &#x7A97;&#x53E3;&#xFF1A;&lt;NSThread: 0x6000015cc600&gt;{number = 4, name = (null)}
2019-08-08 15:21:39.773115+0800 YSC-GCD-demo[18071:4340605] &#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;49 &#x7A97;&#x53E3;&#xFF1A;&lt;NSThread: 0x6000015f8600&gt;{number = 3, name = (null)}
2019-08-08 15:21:39.975041+0800 YSC-GCD-demo[18071:4340605] &#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;47 &#x7A97;&#x53E3;&#xFF1A;&lt;NSThread: 0x6000015f8600&gt;{number = 3, name = (null)}
2019-08-08 15:21:39.975037+0800 YSC-GCD-demo[18071:4340604] &#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;47 &#x7A97;&#x53E3;&#xFF1A;&lt;NSThread: 0x6000015cc600&gt;{number = 4, name = (null)}
2019-08-08 15:21:40.176567+0800 YSC-GCD-demo[18071:4340604] &#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;46 &#x7A97;&#x53E3;&#xFF1A;&lt;NSThread: 0x6000015cc600&gt;{number = 4, name = (null)}
...
</code></pre><h5 id="6622-&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF08;&#x4F7F;&#x7528;-semaphore-&#x52A0;&#x9501;&#xFF09;">6.6.2.2 &#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF08;&#x4F7F;&#x7528; semaphore &#x52A0;&#x9501;&#xFF09;</h5>
<p>&#x8003;&#x8651;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>/**
 * &#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF1A;&#x4F7F;&#x7528; semaphore &#x52A0;&#x9501;
 * &#x521D;&#x59CB;&#x5316;&#x706B;&#x8F66;&#x7968;&#x6570;&#x91CF;&#x3001;&#x5356;&#x7968;&#x7A97;&#x53E3;&#xFF08;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF09;&#x3001;&#x5E76;&#x5F00;&#x59CB;&#x5356;&#x7968;
 */
- (void)initTicketStatusSave {
    NSLog(@&quot;currentThread---%@&quot;,[NSThread currentThread]);  // &#x6253;&#x5370;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;
    NSLog(@&quot;semaphore---begin&quot;);

    semaphoreLock = dispatch_semaphore_create(1);

    self.ticketSurplusCount = 50;

    // queue1 &#x4EE3;&#x8868;&#x5317;&#x4EAC;&#x706B;&#x8F66;&#x7968;&#x552E;&#x5356;&#x7A97;&#x53E3;
    dispatch_queue_t queue1 = dispatch_queue_create(&quot;net.bujige.testQueue1&quot;, DISPATCH_QUEUE_SERIAL);
    // queue2 &#x4EE3;&#x8868;&#x4E0A;&#x6D77;&#x706B;&#x8F66;&#x7968;&#x552E;&#x5356;&#x7A97;&#x53E3;
    dispatch_queue_t queue2 = dispatch_queue_create(&quot;net.bujige.testQueue2&quot;, DISPATCH_QUEUE_SERIAL);

    __weak typeof(self) weakSelf = self;
    dispatch_async(queue1, ^{
        [weakSelf saleTicketSafe];
    });

    dispatch_async(queue2, ^{
        [weakSelf saleTicketSafe];
    });
}

/**
 * &#x552E;&#x5356;&#x706B;&#x8F66;&#x7968;&#xFF08;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF09;
 */
- (void)saleTicketSafe {
    while (1) {
        // &#x76F8;&#x5F53;&#x4E8E;&#x52A0;&#x9501;
        dispatch_semaphore_wait(semaphoreLock, DISPATCH_TIME_FOREVER);

        if (self.ticketSurplusCount &gt; 0) {  // &#x5982;&#x679C;&#x8FD8;&#x6709;&#x7968;&#xFF0C;&#x7EE7;&#x7EED;&#x552E;&#x5356;
            self.ticketSurplusCount--;
            NSLog(@&quot;%@&quot;, [NSString stringWithFormat:@&quot;&#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;%d &#x7A97;&#x53E3;&#xFF1A;%@&quot;, self.ticketSurplusCount, [NSThread currentThread]]);
            [NSThread sleepForTimeInterval:0.2];
        } else { // &#x5982;&#x679C;&#x5DF2;&#x5356;&#x5B8C;&#xFF0C;&#x5173;&#x95ED;&#x552E;&#x7968;&#x7A97;&#x53E3;
            NSLog(@&quot;&#x6240;&#x6709;&#x706B;&#x8F66;&#x7968;&#x5747;&#x5DF2;&#x552E;&#x5B8C;&quot;);

            // &#x76F8;&#x5F53;&#x4E8E;&#x89E3;&#x9501;
            dispatch_semaphore_signal(semaphoreLock);
            break;
        }

        // &#x76F8;&#x5F53;&#x4E8E;&#x89E3;&#x9501;
        dispatch_semaphore_signal(semaphoreLock);
    }
}
</code></pre><p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;&#xFF1A;</p>
<pre><code>2019-08-08 15:23:58.819891+0800 YSC-GCD-demo[18116:4348091] currentThread---&lt;NSThread: 0x600000681380&gt;{number = 1, name = main}
2019-08-08 15:23:58.820041+0800 YSC-GCD-demo[18116:4348091] semaphore---begin
2019-08-08 15:23:58.820305+0800 YSC-GCD-demo[18116:4348159] &#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;49 &#x7A97;&#x53E3;&#xFF1A;&lt;NSThread: 0x6000006ede80&gt;{number = 3, name = (null)}
2019-08-08 15:23:59.022165+0800 YSC-GCD-demo[18116:4348157] &#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;48 &#x7A97;&#x53E3;&#xFF1A;&lt;NSThread: 0x6000006e4b40&gt;{number = 4, name = (null)}
2019-08-08 15:23:59.225299+0800 YSC-GCD-demo[18116:4348159] &#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;47 &#x7A97;&#x53E3;&#xFF1A;&lt;NSThread: 0x6000006ede80&gt;{number = 3, name = (null)}
...
2019-08-08 15:24:08.355977+0800 YSC-GCD-demo[18116:4348157] &#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;2 &#x7A97;&#x53E3;&#xFF1A;&lt;NSThread: 0x6000006e4b40&gt;{number = 4, name = (null)}
2019-08-08 15:24:08.559201+0800 YSC-GCD-demo[18116:4348159] &#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;1 &#x7A97;&#x53E3;&#xFF1A;&lt;NSThread: 0x6000006ede80&gt;{number = 3, name = (null)}
2019-08-08 15:24:08.759630+0800 YSC-GCD-demo[18116:4348157] &#x5269;&#x4F59;&#x7968;&#x6570;&#xFF1A;0 &#x7A97;&#x53E3;&#xFF1A;&lt;NSThread: 0x6000006e4b40&gt;{number = 4, name = (null)}
2019-08-08 15:24:08.965100+0800 YSC-GCD-demo[18116:4348159] &#x6240;&#x6709;&#x706B;&#x8F66;&#x7968;&#x5747;&#x5DF2;&#x552E;&#x5B8C;
2019-08-08 15:24:08.965440+0800 YSC-GCD-demo[18116:4348157] &#x6240;&#x6709;&#x706B;&#x8F66;&#x7968;&#x5747;&#x5DF2;&#x552E;&#x5B8C;
</code></pre><p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5728;&#x8003;&#x8651;&#x4E86;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528; dispatch_semaphore
&#x673A;&#x5236;&#x4E4B;&#x540E;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7968;&#x6570;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x6DF7;&#x4E71;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x7684;&#x95EE;&#x9898;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2018-09-20-深入理解Objective-C：Category.html" class="navigation navigation-prev " aria-label="Previous page: 第12节：深入理解Objective-C：Category">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2020-02-02-weak实现.html" class="navigation navigation-next " aria-label="Next page: 第14节：weak实现">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第13节：GCD","level":"1.2.13","depth":2,"next":{"title":"第14节：weak实现","level":"1.2.14","depth":2,"path":"Chapter1/2020-02-02-weak实现.md","ref":"Chapter1/2020-02-02-weak实现.md","articles":[]},"previous":{"title":"第12节：深入理解Objective-C：Category","level":"1.2.12","depth":2,"path":"Chapter1/2018-09-20-深入理解Objective-C：Category.md","ref":"Chapter1/2018-09-20-深入理解Objective-C：Category.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Chapter1/2019-09-17-GCD.md","mtime":"2021-03-11T10:37:57.461Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-15T08:25:04.027Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

